[
  {
    "tag": "about_us",
    "patterns": [
      "About Us",
      "Tell me about Swan Solutions"
    ],
    "responses": {
      "formal": [
        "Empowering Excellence through Elegance and Innovation At Swan Solutions, we are committed to providing cutting-edge technological solutions that empower businesses to excel in the modern digital landscape."
      ],
      "informal": [
        "We empower excellence through elegance and innovation. Swan Solutions is dedicated to providing cutting-edge technological solutions to help businesses thrive in the digital age."
      ],
      "neutral": [
        "Swan Solutions is committed to providing cutting-edge technological solutions that empower businesses to excel in the modern digital landscape."
      ]
    }
  },
  {
    "tag": "fig_app",
    "patterns": [
      "What is the Fig App?",
      "Tell me about the Fig App"
    ],
    "responses": {
      "formal": [
        "The Fig App offers professional development, wellness, and more. Find out more by subscribing now."
      ],
      "informal": [
        "The Fig App provides professional development, wellness, and more. Subscribe now to learn more."
      ],
      "neutral": [
        "The Fig App offers a range of services including professional development and wellness. Subscribe now to find out more."
      ]
    }
  },
  {
    "tag": "subscribe_fig_app",
    "patterns": [
      "Subscribe Now",
      "How can I subscribe to the Fig App?"
    ],
    "responses": {
      "formal": [
        "To subscribe to the Fig App, please visit our website and follow the subscription process."
      ],
      "informal": [
        "Simply head to our website and sign up for the Fig App subscription to access professional development and wellness services."
      ],
      "neutral": [
        "You can subscribe to the Fig App by visiting our website and following the subscription process. Enjoy access to professional development and wellness services."
      ]
    }
  },
  {
    "tag": "Home",
    "patterns": [
      "Home",
      "Homepage",
      "Main page"
    ],
    "responses": {
      "formal": [
        "Welcome to our homepage. How can I assist you today?",
        "Greetings, how may I help you navigate our website today?"
      ],
      "informal": [
        "Hey there! What can I help you find on our homepage?",
        "Hi! How can I assist you with our homepage?"
      ],
      "neutral": [
        "Welcome to the homepage. What information are you looking for?",
        "Hello, how can I help you on our homepage today?"
      ]
    }
  },
  {
    "tag": "About Us",
    "patterns": [
      "About Us",
      "Company information",
      "Who we are"
    ],
    "responses": {
      "formal": [
        "Welcome to the About Us section. How can I provide you with information about our company?",
        "Greetings! How may I assist you with information regarding our company?"
      ],
      "informal": [
        "Hey! Need info about our company? I got you covered. How can I help?",
        "Hi there! Looking for details about our company? Let me help you out."
      ],
      "neutral": [
        "Welcome to the About Us section. What specific details are you looking for about our company?",
        "Hello! How can I assist you with information about our company?"
      ]
    }
  },
  {
    "tag": "Employee Resources",
    "patterns": [
      "Employee Resources",
      "HR information",
      "Employee portal"
    ],
    "responses": {
      "formal": [
        "Welcome to Employee Resources. How can I assist you regarding HR information?",
        "Greetings! How may I help you with our employee portal and HR resources?"
      ],
      "informal": [
        "Hey there! Need help with employee resources or HR info? Let me know!",
        "Hi! Looking for HR information or the employee portal? I'm here to assist."
      ],
      "neutral": [
        "Welcome to Employee Resources. What specific HR information are you looking for or how can I assist with the employee portal?",
        "Hello! How can I help you with HR information or accessing the employee portal?"
      ]
    }
  }
]