[
  {
    "url": "https://swank12.swancreate.com",
    "title": "Home",
    "content": "Home About Us Solutions FIG K-12 CONSULTING BUSINESS AUTOMATION CONTENT MANAGEMENT BALANCE BUDDY PARTNERS, PROJECTS EMPLOYEE RESOURCES CAREERS PRIVACY Contact 0 % Start Swan Solutions Is A Consulting Company Specializing In Information Technology, From Database And Workflow Design To Business Intelligence Solutions. We Offer Business Management Consulting For Any Industry. For K-12 Specifically, We Have Expert Level Experience In School Nutrition Technology. The Effective Features The business cerrent account that is your accounting software. A simple way to run your bussiness. Interactive Portals Our feature-rich portals empower nutrition districts and companies to manage their operations more efficiently. Mobile Applications Extend your reach and engage with your audience on-the-go with our custom mobile applications. Data Analytics and Reporting Gain valuable insights into your nutrition programs and make data-driven decisions with our comprehensive analytics and reporting tools. Security and Compliance We understand the importance of data security and compliance, especially when handling sensitive information related to nutrition programs and student data. Data Analytics and Reporting Gain valuable insights into your nutrition programs and make data-driven decisions with our comprehensive analytics and reporting tools. CONTACT US Security and Compliance We understand the importance of data security and compliance, especially when handling sensitive information related to nutrition programs and student data. Security and Compliance Our web solutions adhere to industry best practices, ensuring data encryption, secure user authentication, and compliance with relevant regulations such as FERPA and HIPAA. Show More Exceptional Support and Collaboration We work closely with you throughout the development process, from initial consultation and planning to deployment and ongoing maintenance. Exceptional Support and Collaboration Our team is always ready to provide technical assistance, training, and continuous improvements to ensure your web solutions remain effective and up-to-date. Show More About Us April 19, 2022 \"LiquidOffice and Documentum Integration\" Collier County Schools April 19, 2022 \"LiquidOffice and Process Automation\" Orange County Public Schools March 8, 2021 \"The National School Lunch Program is the second-largest anti-hunger program in the country. Lifetime Foundation February 17, 2021 \"Swan Solutions is proud to be a Silver Level Services Partner for business automation processes.\" OpenText Silver Services Partner February 17, 2021 \"Swan Scoring is the next generation scoring and event management platform for the CrossFit community.\" Swan Scoring February 17, 2021 \"The FIG App is a product of the partnership between Project School Nutrition and Swan Solutions.\" The FIG App February 17, 2021 \"Joey Paladino from 3P Fitness says, \" I’m super excited to have Dusty and Becki Swan as part of our team.\" Emerald Coast Throwdown February 17, 2021 \"Ashley Morena, Founder and CEO of PSN, says, \"Swan Solutions Business Consulting services with Becki has been the best.\" Project School Nutrition Subscribe Now About Us Empowering Excellence through Elegance and Innovation At Swan Solutions, we are committed to providing cutting-edge technological solutions that empower businesses to excel in the modern digital landscape. PAGES Home About Us Services Contact HELP About Us Partners, Projects Contact Privacy SOCIAL MEDIA Copyright © 2023 Swan Solutions - All Rights Reserved.",
    "timestamp": "2024-12-28T09:37:28.891Z"
  },
  {
    "url": "https://swank12.swancreate.com/contact.html",
    "title": "Contact Us",
    "content": "Home About Us Solutions FIG K-12 CONSULTING BUSINESS AUTOMATION CONTENT MANAGEMENT BALANCE BUDDY PARTNERS, PROJECTS EMPLOYEE RESOURCES CAREERS PRIVACY Contact CONTACT US let's get in touch SEND US A MESSAGE CONNECT WITH US Becki Swan (Email Address) Becki@SwanSolutionsLLC.com Dusty Swan (Email Address) dusty@swansolutionsllc.com Dusty Swan (Call Us) (800) 817-1408 Location 5189 Stewart Street, Milton, Florida 32570, United States social media Location Location Name 5189 Stewart Street, Milton, Florida 32570, United States INSTAGRAM Subscribe Now About Us Empowering Excellence through Elegance and Innovation At Swan Solutions, we are committed to providing cutting-edge technological solutions that empower businesses to excel in the modern digital landscape. PAGES Home About Us Services Contact HELP About Us Partners, Projects Contact Privacy SOCIAL MEDIA Copyright © 2023 Swan Solutions - All Rights Reserved.",
    "timestamp": "2024-12-28T10:07:28.560Z"
  },
  {
    "url": "https://wordworksai.com/services",
    "title": "Our Services | WordWorks - Enterprise AI SolutionsYoutube-color",
    "content": "WordWorks AIOpen main menuHomeProductsServicesIndustriesCompanyContact usExpert AI Implementation ServicesFrom custom development to seamless integration, our expert team delivers end-to-end AI services tailored to your business needs. Transform your operations with our comprehensive AI implementation solutions.Custom AI DevelopmentTailored AI solutions designed specifically for your business needs and industry requirements.Industry-specific SolutionsScalable ArchitectureCustom AlgorithmsPerformance OptimizationLearn MoreAI Integration ServicesSeamlessly integrate our AI solutions with your existing systems and workflows.System AnalysisData MigrationAPI DevelopmentContinuous SupportLearn MoreAI Training & SupportComprehensive training and ongoing support to ensure maximum value from your AI implementation.User TrainingTechnical Documentation24/7 SupportRegular UpdatesLearn MoreManaged AI ServicesFull-service AI management and optimization to keep your solutions running at peak performance.Performance MonitoringRegular MaintenanceSecurity UpdatesOptimization ServicesLearn MoreFooterTelephone+971 5816 14745Telephone+91 90423 14745Emailtalktoai@wordworksai.comAddressIndia | UAE | Saudi Arabia | Australia | CanadaCompanyProductsServicesIndustriesAboutBlogContactProductsAI ChatbotAI VoicebotServicesERP & CRMIT OutsourcingSubscribe to our newsletterThe latest news, articles, and resources, sent to your inbox weekly.Email addressSubscribeFollow us on Youtube-color Created with Sketch. © 2025 WordWorks AI, Inc. All rights reserved.",
    "timestamp": "2025-01-20T01:34:00.747Z"
  },
  {
    "url": "https://wordworksai.com/about-us",
    "title": "About Us | WordWorks AI - Enterprise AI SolutionsYoutube-color",
    "content": "WordWorks AIOpen main menuHomeProductsServicesIndustriesCompanyContact usWe're changing changing the way people connect.Empower agents. Engage customers in human-like conversations. Elevate CSAT with WordWorks Gen AI for exceptional customer experiences.Our missionAt WordWorks AI, our mission is to transform business communication through innovative Gen AI solutions. We aim to create seamless, human-like interactions that empower businesses to deliver outstanding customer experiences. Our goal is to make every customer interaction efficient, personalized, and impactful.Our visionWordWorks Gen AI started in February 2024 with a vision to revolutionize business communication. We quickly became known for our innovative Gen AI chatbots, voice bots, IT outsourcing, and CRM & ERP services. Our journey is driven by a passion for excellence, a commitment to innovation, and a focus on creating meaningful customer experiences.Our Journey and MilestonesSince launching in February 2024, WordWorks Gen AI has made significant strides in transforming business communication. Here are some of the milestones we've achieved so farEmpowering BusinessesMany clients trust us to enhance their customer interactions with our innovative Gen AI solutions.Startup SuccessWe've supported numerous startups in securing funding and achieving their business goals.Major InvestmentsOur efforts have driven significant growth and innovation in the tech sector, supported by a substantial funding pool.Global ImpactOur Gen AI solutions are utilized by startups and enterprises worldwide, improving customer satisfaction and operational efficiency.Collaborating with Industry LeadersPartnering with top global brands and innovative startups to drive excellence in Gen AI solutions.What's Cooking On WordWorksAI?Embrace cutting-edge conversational Gen AI solutions empowered by Generative AI, delivering highly personalized and context-aware interactions that exceed customer expectations.FooterTelephone+971 5816 14745Telephone+91 90423 14745Emailtalktoai@wordworksai.comAddressIndia | UAE | Saudi Arabia | Australia | CanadaCompanyProductsServicesIndustriesAboutBlogContactProductsAI ChatbotAI VoicebotServicesERP & CRMIT OutsourcingSubscribe to our newsletterThe latest news, articles, and resources, sent to your inbox weekly.Email addressSubscribeFollow us on Youtube-color Created with Sketch. © 2025 WordWorks AI, Inc. All rights reserved.",
    "timestamp": "2025-01-20T01:34:10.388Z"
  },
  {
    "url": "https://wordworksai.com",
    "title": "Experience AI-Powered Business Solutions | WordWorks AIYoutube-color",
    "content": "WordWorks AIOpen main menuHomeProductsServicesIndustriesCompanyContact usNew ReleaseEnterprise Voice AI - 95% Accuracy in 100+ LanguagesTransform Customer Experience with Our Gen AI SolutionsFrom chaos to connection, Meet our Gen AI Voicebots and Chatbots that elevate your business, exceed expectations, and transform customer experiences like never before.Enterprise-Grade SecurityMultilingual Support40% Cost SavingsSeamless IntegrationSchedule a callSee our productsCollaborating with Industry LeadersPartnering with top global brands and innovative startups to drive excellence in Gen AI solutions.Transform Customer Interactions into Memorable ExperiencesWatch how our advanced Gen AI makes conversations more engaging, efficient, and enjoyable.Feel the Difference - Why Settle for Less?With WordWorksAI, your customers get more than just answers; they get assistance that feels personal and thoughtful. Our AI's conversational abilities ensure that every interaction leaves a positive impression, setting you apart from the competition.Step into the Future - Get a Free POC Today!Our ServicesWatch how our advanced Gen AI makes conversations more engaging, efficient, and enjoyable.01AI ChatbotsAI ChatbotsAI Voice BotsCRM & ERP SolutionsIT OutsourcingGen AI ChatbotEngage Customers AnytimeOur Gen AI chatbots are dedicated to enhancing response accuracy and speed, providing instant, reliable support 24/7 to boost customer engagement and efficiency.Learn moreGen AI Voice BotNatural Conversations, Better ServiceOur Gen AI voice bots handle high call volumes, offer human-like interactions, and provide real-time analytics. Ideal for lead capturing, convincing arguments, and lead generation with sentiment analysis and correction.Learn moreCRM & ERP SolutionsStreamline Your BusinessOur CRM and ERP solutions integrate effortlessly, enhancing decision-making and operational efficiency.Learn moreIT OutsourcingBoost Efficiency with Expert ITAccess skilled IT professionals, save costs, and scale your business with our flexible outsourcing services.Learn moreWhy Pick WordWorks AI?Dive deep into each project with comprehensive case studies that outline challenges, strategies, and outcomes.Cutting-Edge TechnologyStay ahead with our top-notch Gen AI and machine learning solutions, always evolving to bring you the latest advancements.Industry ExpertiseWith industry experience, we offer Gen AI solutions tailored for startups to drive innovation and growth.Custom SolutionsNo two businesses are the same. We create Gen AI solutions tailored to your unique needs.Effortless IntegrationOur Gen AI integration solutions are designed to seamlessly integrate with your existing systems, ensuring minimal disruption while optimizing your operations.24/7 SupportDay or night, our dedicated support team ensures your Gen AI solutions run smoothly and efficiently.Industries ServedFrom healthcare to Automotive, our deep domain expertise ensures that solutions work for you.Auto IndustryTransform Your Service, Drive SuccessRev up your customer service with Gen AI that handles inquiries, schedules appointments, and provides real-time support, including a FAQ bot, keeping your dealership, automobile supply business, or service center running smoothly.Finance IndustryMaximize Efficiency, Minimize RiskEnhance your financial operations with Gen AI solutions that boost productivity and reduce risks. Our Gen AI includes financial advisory bots, fraud detection systems, credit scoring bots, customer service chatbots, and compliance monitoring tools.Healthcare IndustryCare That ConnectsEnhance patient engagement and care in healthcare hospitals, dispensaries, and diagnostic labs with AI-driven appointment scheduling, reminders, 24/7 support, and a FAQ bot, ensuring patients feel valued and informed.View AllTestimonialsWe have worked with thousands of amazing people“WordWorks Gen AI Chatbots have transformed our customer service. The 24/7 availability and instant responses have significantly boosted our customer satisfaction levels. We can't imagine going back to the old ways!”Ravi Carter@AI Chatbot“The Gen AI Voice Bots from WordWorks Gen AI have streamlined our customer interactions. Handling high call volumes has never been easier, and our customers appreciate the quick, human-like responses.”Aaisha Khanna@AI Voicebot“WordWorks Gen AI Voice Bots have significantly improved our sales process. Scheduling test drives and providing information has never been this efficient. Our sales conversions have increased noticeably.”Nadia Roberts@AI Voicebot“Implementing WordWorks AI's CRM & ERP solutions was a game-changer for us. Our decision-making process has become more data-driven, and operational efficiency has soared. Highly recommend!”Omar Patel@CRM & ERP Solutions“Outsourcing our IT needs to WordWorks Gen AI was one of the best decisions we've made. The expertise and support we receive are top-notch, allowing us to focus more on our core business.”Priya Davis@IT Outsourcing“Our patient engagement has improved drastically since we started using WordWorks Gen AI Chatbots. They handle routine inquiries seamlessly, freeing up our staff to deal with more complex issues.”Swapnil Pathak@AI Chatbot“WordWorks Gen AI has been instrumental in modernizing our operations. Their Gen AI solutions are incredibly efficient and have helped us achieve higher productivity and better customer interactions.”Rahul Saxena@AI ChatbotDownloadable ContentEmbrace cutting-edge conversational Gen AI solutions empowered by Generative AI, delivering highly personalised and context-aware interactions that exceed customer expectations.BrochuresDetailed information about our services and offerings.Download now →Case StudiesDownloadable PDFs of success stories.Download now →Latest from WordWorks AIStay updated with our latest insights on AI technology and business solutions.FooterTelephone+971 5816 14745Telephone+91 90423 14745Emailtalktoai@wordworksai.comAddressIndia | UAE | Saudi Arabia | Australia | CanadaCompanyProductsServicesIndustriesAboutBlogContactProductsAI ChatbotAI VoicebotServicesERP & CRMIT OutsourcingSubscribe to our newsletterThe latest news, articles, and resources, sent to your inbox weekly.Email addressSubscribeFollow us on Youtube-color Created with Sketch. © 2025 WordWorks AI, Inc. All rights reserved.",
    "timestamp": "2025-01-20T01:35:44.317Z"
  },
  {
    "url": "https://wordworksai.com/contact-us",
    "title": "Experience AI-Powered Business Solutions | WordWorks AIYoutube-color",
    "content": "WordWorks AIOpen main menuHomeProductsServicesIndustriesCompanyContact usContact UsGet in touch with usWe are always here to help you outline challenges, strategies, and outcomes.Our Global PresenceINDIAWWAI Consulting and IT solutions PVT LTD1161, 127A, BRICLING ROAD, Kilpauk, Perambur Purasawalkam, Chennai-600010, Tamil Nadu, India.USAWord Works AI INC131 Continental Dr, Suite 305, Newark, DE 19713, New Castle, USA.UAEWord Works Ai Middle East L.L.C-FZMeydan Grandstand, 6th floor, Meydan Road, Nad Al Sheba, Dubai, U.A.E.FULL NAME*EMAIL*PHONE NUMBER*COMPANY NAME*BUSINESS SIZESelect business size1-10 employees11-50 employees51-200 employees201-500 employees501-1000 employees1000+ employeesAI SOLUTION INTEREST*Select AI solutionGen AI ChatbotVoice AI BotCustom AI SolutionCRM/ERP IntegrationMultiple SolutionsNot Sure YetADDITIONAL MESSAGEBy submitting this form, I agree to the privacy policy.SubmitTestimonialsWe have worked with thousands of amazing people“WordWorks Gen AI Chatbots have transformed our customer service. The 24/7 availability and instant responses have significantly boosted our customer satisfaction levels. We can't imagine going back to the old ways!”Ravi Carter@AI Chatbot“The Gen AI Voice Bots from WordWorks Gen AI have streamlined our customer interactions. Handling high call volumes has never been easier, and our customers appreciate the quick, human-like responses.”Aaisha Khanna@AI Voicebot“WordWorks Gen AI Voice Bots have significantly improved our sales process. Scheduling test drives and providing information has never been this efficient. Our sales conversions have increased noticeably.”Nadia Roberts@AI Voicebot“Implementing WordWorks AI's CRM & ERP solutions was a game-changer for us. Our decision-making process has become more data-driven, and operational efficiency has soared. Highly recommend!”Omar Patel@CRM & ERP Solutions“Outsourcing our IT needs to WordWorks Gen AI was one of the best decisions we've made. The expertise and support we receive are top-notch, allowing us to focus more on our core business.”Priya Davis@IT Outsourcing“Our patient engagement has improved drastically since we started using WordWorks Gen AI Chatbots. They handle routine inquiries seamlessly, freeing up our staff to deal with more complex issues.”Swapnil Pathak@AI Chatbot“WordWorks Gen AI has been instrumental in modernizing our operations. Their Gen AI solutions are incredibly efficient and have helped us achieve higher productivity and better customer interactions.”Rahul Saxena@AI ChatbotFooterTelephone+971 5816 14745Telephone+91 90423 14745Emailtalktoai@wordworksai.comAddressIndia | UAE | Saudi Arabia | Australia | CanadaCompanyProductsServicesIndustriesAboutBlogContactProductsAI ChatbotAI VoicebotServicesERP & CRMIT OutsourcingSubscribe to our newsletterThe latest news, articles, and resources, sent to your inbox weekly.Email addressSubscribeFollow us on Youtube-color Created with Sketch. © 2025 WordWorks AI, Inc. All rights reserved.",
    "timestamp": "2025-01-20T01:44:48.042Z"
  },
  {
    "url": "https://kellestya.com",
    "title": "Kellestya – Kellestya",
    "content": "Kellestya Menu Home Shop Flora 0,00 د.إ Menu Home Shop Flora Menu Home Shop Flora 0 Full 1Full 2Full 3 Flora Add to cart Azure180,00 د.إ Add to cart Blossom170,00 د.إ Add to cart Emerald150,00 د.إ Add to cart Zephyr160,00 د.إ Load More Add to cart Azure180,00 د.إ Add to cart Blossom170,00 د.إ Add to cart Emerald150,00 د.إ Add to cart Zephyr160,00 د.إ Load More Trending Azure 180,00 د.إ Blossom 170,00 د.إ Emerald 150,00 د.إ Zephyr 160,00 د.إ Jade 170,00 د.إ Coral Discover effortless style with our [Product Name], perfect for every occasion. Crafted from [Material/Features], this [Type of Clothing] offers [Comfort/Style/Utility].… 180,00 د.إ Select options This product has multiple variants. The options may be chosen on the product page Coral180,00 د.إ Add to cart Jade170,00 د.إ Add to cart Zephyr160,00 د.إ Load More Shop From Instagram Tag us at #kellestya! We can’t wait to see how you style with us! KELLESTYA Our aim is to add elegance to everyday clothing, giving you stylish pieces that bring a fresh look to the high street. We want to make your daily outfits more special with a touch of simple elegance. Contact Us +971 50 791 9609info@kellestya.com Instagram Facebook Youtube Quick Links Menu Privacy Policy Exchange Policy Terms & Conditions Subscribe Subscribe Join our community to discover new collections, receive exclusive updates, and access special discounts. © 2024 KELLESTYA | All Rights Reserved.",
    "timestamp": "2025-01-26T03:26:06.698Z"
  }
]