{
  "url": "https://wpmachina.com/refund/#",
  "data": "Home\nAbout Us\nServices \n\n\n\n\tColumn 1\n\t\n\t\t Service\n\t\t Service\n\t\t Service\n\t\t Service\n\t\n\n\tColumn 2\n\t\n\t\t Service\n\t\t Service\n\t\t Service\n\t\t Service\n\t\n\n\tColumn 3\n\t\n\t\t Service\n\t\t Service\n\t\t Service\n\t\t Service\n\t\n\n\n\n\n\nBlog\nContact Us\nGet Started \nSign in\n\n\t        \t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t          \n\t\t\t\t\t\t          Menu\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tMenu\n\t\t\t\t\t\t\n\t        \t\t     \n\t\t\n\t\t\n\n\n\n\n\t\n\n\tRefund Policy\nWebmaster Solutions strives to deliver high-quality work that meets the agreed-upon Scope of Work (SOW). If the work produced does not meet your expectations, you may be eligible for a partial or full refund. Our team will try to fix the issues whenever possible before issuing the refund. We may even offer to solve a problem for you in certain situations.\nYou must meet the following conditions to receive a refund:\n\nThe request must be made within 14 days of receiving the payment to request a refund.\nThe plugin must not have worked for your business or required setup after testing.\nYou must have attempted to resolve your issues with our support team\nBy requesting and receiving a refund, you agree to submit your license and stop using the product immediately\nYou agree to deactivate and uninstall the plugin from your site if a refund is granted\n\nHowever, please note that our refund policy does not apply in the following cases:\n\nIf the client cancels after the work has already begun, we will not be able to cancel the project\nIf the SOW deviates from the original agreement and the client refuses to pay for the additional work\n\nHere are the types of refunds available:\n\nFull refund\nIf the assignment has not started or the documentation has not been initiated, a full refund may be possible. The refund process will begin after receiving the upfront payment and take up to 45 days to complete.\nPartial refund\nIf there is a failure to deliver as per the agreed solution/SOW in the signed contract, a partial refund may be granted based on the percentage of work completed.\nNo refunds\nA refund will not be granted after the assignment has been completed.\n\n\n \t\t\n\n\n\n\n\n\nKeep in touch for latest offers!\n\nEmail * \nLink to FacebookLink to XLink to LinkedIn\nCompanyOur Story\nFeedback\nContact Us\n\n \t\t\n\n\t\n\t\t\t\t\n                    \n\n                        2024 © Copyright - WP Machina | Webmasters  \n\n                        Refund Policy\nPrivacy Policy\nCookies Policy\nTerms of Use\nFAQs\n\n                    \n\n\t            \n\t\t\t\t\n\n\n\t\t\t\t\t\n\t\t\n\n\t\t\n\nScroll to top\n\n\n\nShopping cart0There are no products in the cart!Continue shopping0"
}