{
  "url": "https://www.tidio.com/blog/suitor-case-study/",
  "data": "<iframe src=\"https://www.googletagmanager.com/ns.html?id=GTM-TFKGCT9\" height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe>Meet Lyro AI Chatbot - Solve up to 70% of customer problems with AILog inProductLyro AI ChatbotHelp Desk & Live ChatFlowsIntegrationsSee all Tidio featuresLyro AI ChatbotLearn more about Lyro AI ChatbotCase studiesBella SanteSuitorTidio SupportResourcesAI Chatbot BattlesTidio Academy courseHelp Desk & Live ChatLearn more about Help DeskFeaturesLive ChatTicketingMultichannelResourcesHelp Desk ChecklistBest PracticesFlowsLearn more about FlowsPlaybooksReplicate In-store Shopping OnlineWin Leads and Sales with Automation & AIEcommerce hubFlows ROI CalculatorSales Tactics for Ecommerce GrowthIntegrationsLearn more about AnalyticsPlatformsShopifyWordPressSee all integrationsChannelsWhatsappInstagramMessengerWatch DemoContact SalesLyro AI ChatbotWin up to 70% of your team’s time back. Automatically answer common questions and perform recurring tasks with AI.Learn more about Lyro AI ChatbotCase studiesBella SanteSuitorTidio SupportResourcesAI Chatbot BattlesTidio Academy courseHelp DeskDrive customer satisfaction with live chat, ticketing, video calls, and multichannel communication - everything you need for customer service.Learn more about Help DeskFeaturesLive ChatTicketingMultichannelResourcesHelp Desk ChecklistBest PracticesFlowsBoost your lead gen and sales funnels with Flows - no-code automation paths that trigger at crucial moments in the customer journey.Learn more about FlowsPlaybooksReplicate In-store Shopping OnlineWin Leads and Sales with Automation & AIEcommerce hubFlows ROI CalculatorSales Tactics for Ecommerce GrowthAnalyticsKeep track of the data that matters to your business. Monitor the performance of your team, Lyro AI Chatbot, and Flows.Learn more about AnalyticsPlatformsShopifyWordPressSee all integrationsChannelsWhatsappInstagramMessengerSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesPricingEcommerceResourcesCustomer StoriesLearnCompareHelp CenterBlogSee all ResourcesCustomer StoriesNewest case studyeye-oo Boosts Revenue by €177K+ After Installing TidioDiscover how this Shopify store used Tidio to offer better service, recover carts, and boost sales.Customer StoriesADT Security Service Improves CSAT by 30% Using TidioBella Santé Adds $66K+ to Revenue with Lyro AI ChatbotEndeksa’s Lead Generation Grows by 138% with Tidio FlowsSee allLearnTidio AcademyTidio AcademyPropel your customer service to the next level with Tidio’s free courses.PlaybooksReplicate In-store Shopping OnlineHow to Leverage AI in Customer ServiceWin Leads and Sales with Automation & AISee all PlaybooksGuidesSales Tactics for Ecommerce GrowthThe Successful Help Desk ChecklistResourcesPodcastsFlows ROI CalculatorSee all ResourcesCompareCompare TidioTidio vs GorgiasTidio vs IntercomTidio vs LiveChatTidio vs ZendeskAI ShowdownLyro vs ZowieLyro vs AdaLearn more about Lyro AI ChatbotOther comparisonsAI Customer Support: 10 Best SolutionsBest WordPress Chat PluginsTop 10 Shared Inbox ToolsTop 8 Squarespace Chat PluginsHelp CenterGo to Help CenterSetupInstall TidioGet startedWidget customizationManage Your ProjectUsing TidioLyro AI ChatbotFlowsHelp DeskTidio FeaturesOther ResourcesIntegrationsBilling & SubscriptionMobile & Desktop AppsNotificationsBlogGo to Tidio BlogChatbotsBest AI ChatbotsWordPress Chatbot PluginsShopify Chatbot AppsWooCommerce Chatbot PluginsHow to Create a ChatbotLive ChatFree Live Chat Software for WebsitesShopify Live Chat AppsSquarespace Chat PluginsLive Chat for Sales TeamsHow to Add Live Chat to a WebsiteTools for BusinessChatbots for EcommerceLive Chat for EcommerceChatbots for Sales and MarketingChatbots for Real EstateLive Chat for Customer ServiceNewest case studyeye-oo Boosts Revenue by €177K+ After Installing TidioDiscover how this Shopify store used Tidio to offer better service, recover carts, and boost sales.Customer StoriesSee allADT Security Service Improves CSAT by 30% Using TidioBella Santé Adds $66K+ to Revenue with Lyro AI ChatbotEndeksa’s Lead Generation Grows by 138% with Tidio FlowsTidio AcademyTidio AcademyPropel your customer service to the next level with Tidio’s free courses.PlaybooksReplicate In-store Shopping OnlineHow to Leverage AI in Customer ServiceWin Leads and Sales with Automation & AISee all PlaybooksGuidesSales Tactics for Ecommerce GrowthThe Successful Help Desk ChecklistResourcesPodcastsFlows ROI CalculatorSee all ResourcesCompare TidioTidio vs GorgiasTidio vs IntercomTidio vs LiveChatTidio vs ZendeskAI ShowdownLyro vs ZowieLyro vs AdaLearn more about Lyro AI ChatbotOther comparisonsAI Customer Support: 10 Best SolutionsBest WordPress Chat PluginsTop 10 Shared Inbox ToolsTop 8 Squarespace Chat PluginsHelp CenterHit the ground running - Master Tidio quickly with our extensive resource library. Learn about features, customize your experience, and find out how to set up integrations and use our apps.Go to Help CenterSetupInstall TidioGet startedWidget customizationManage Your ProjectUsing TidioLyro AI ChatbotFlowsHelp DeskTidio FeaturesOther ResourcesIntegrationsBilling & SubscriptionMobile & Desktop AppsNotificationsTidio BlogKeep up with emerging trends in customer service and learn from top industry experts. Master Tidio with in-depth guides and uncover real-world success stories in our case studies. Discover the blueprint for exceptional customer experiences and unlock new pathways for business success.Go to Tidio BlogChatbotsBest AI ChatbotsWordPress Chatbot PluginsShopify Chatbot AppsWooCommerce Chatbot PluginsHow to Create a ChatbotLive ChatFree Live Chat Software for WebsitesShopify Live Chat AppsSquarespace Chat PluginsLive Chat for Sales TeamsHow to Add Live Chat to a WebsiteTools for BusinessChatbots for EcommerceLive Chat for EcommerceChatbots for Sales and MarketingChatbots for Real EstateLive Chat for Customer ServicePartnersLet's TalkPartner ProgramsFind a trusted agencyPartner portalContactSee Tidio in actionContact salesGet started freeTidio>Blog>Case StudiesSuitor Hits 85% Customer Service Automation With Lyroby Beata Stefanowicz·Updated Jun 21, 2024See what Tidio can do for your businessGet demo Get started for free\n\n\n\n\nCustomers are browsing your website at any hour of the day. And they might need your support when you’re offline. \n\n\n\nSuitor found a perfect solution to that problem.\n\n\n\nThis Australian suit and tuxedo rental company uses Tidio to offer 24/7 customer service without the need for a representative to spend endless hours on the chat. The business automates support processes by using AI-powered chatbots that answer frequently asked questions, sort through requests, and more.\n\n\n\nLet’s find out more about Suitor and how it uses Tidio to grow.\n\n\n\nExperience the new way to hire formalwear\n\n\n\n\n\n\n\nInformation about the company\n\n\n\n\nIndustry: suit rental\n\n\n\nStarted year: October 2017\n\n\n\nSize: 5 employees\n\n\n\nCountry of origin/headquarters: Australia\n\n\n\nTidio products/tactics used: chatbots and automation\n\n\n\n\nYou need a suit when going to a big event, but don’t want to spend thousands of dollars on something you’ll wear once a year. \n\n\n\nThe easy solution is—to rent it.\n\n\n\nThis is what Suitor offers. Suits and tuxedo to rent or buy. \n\n\n\nThe company started from one of the founder’s garage and grew to a million-dollar business that snatched two sharks in the Australian SharkTank in October 2023. They’re going around the world with great quality suits, providing a great solution for customers. \n\n\n\n\n\n\n\n\n\n\n\nThe challenges Suitor faced\n\n\n\nWhen growing a business, the founders of Suitor started to struggle with a growing number of customer service queries. Constant replying to most common questions took too much of the owners’ time, especially given that the answers were already available on the website.\n\n\n\nThey needed something that would answer FAQs in a natural way and filter through the incoming requests.\n\n\n\nThe solution to this problem? \n\n\n\nLyro, a conversational AI provided by Tidio.\n\n\n\nAfter checking a few available platforms, Suitor decided to choose Tidio because of its easy-to-use interface and artificial intelligence chatbots. The owners trained and tested Lyro and found that it can take care of most of the clients’ questions. And shoppers are happy with it, praising the brand’s customer service experience.\n\n\n\n\n\n    The number one thing that has grown our business is offering that customer service experience the rest of the market has not been able to do.\n    \n        \n        \n          \n              Daniel Reid               Co-founder and CEO of Suitor           \n    \n    \n    \n\n\n\nSo, let’s discover, in more detail, how Tidio helped Suitor automate the customer service while still providing great experience to shoppers.\n\n\n\nAutomatic responses to customer service inquiries\n\n\n\nSuitor was able to reach up to 85% of customer service automation using Lyro. This means that most of the queries are taken care of automatically by an artificial intelligence chatbot. The best part—customers love it and the owners of the company are much happier.\n\n\n\n\n\n\n\nLyro answers simple FAQs, learns with input, and communicates with shoppers using natural language which improves the overall customer experience. On top of that, thanks to automation, Suitor is there for the clients at any hour of the day. With many orders coming through after 8 pm, it’s important that buyers receive support when the representatives aren’t online. \n\n\n\n\n\n    I’m so much happier because we can trust that the customer service is being taken care of by the chatbot.\n    \n        \n        \n          \n              Daniel Reid               Co-founder and CEO of Suitor           \n    \n    \n    \n\n\n\n2. Decrease in average response time\n\n\n\nThe average response time before upgrading to the Tidio+ plan and implementing Lyro was about 3 minutes. This was the time when Suitor was primarily using the live chat feature of the platform.\n\n\n\n\n\n\n\nWhen the owners decided to add conversational AI to their website, the response time dropped to a whopping 6 seconds! That’s a huge decrease which is definitely appreciated by the clients who now get support instantly.\n\n\n\n\n\n    Lyro gives customers 24-hour support. Even if it doesn’t always fully answer the question, it gives them enough information to go through the website.\n    \n        \n        \n          \n              Daniel Reid               Co-founder and CEO of Suitor           \n    \n    \n    \n\n\n\n3. Visitor behavior analysis across platforms\n\n\n\nOne of the deciding factors for going with Tidio was the integrations and the easy setup. The company needed a platform that smoothly integrates with WooCommerce, Facebook, and other channels. This way the owners could keep all the communication in one place, measure the performance, and scale their customer support operations.\n\n\n\nMoreover, once Tidio was set up, owners didn’t have to worry about customer support anymore as chatbots did their thing and sent complex queries to the live agents automatically. As it turned out, it’s not really necessary in the majority of the cases, because only 24% of queries are transferred to a human representative, on average.\n\n\n\n\n\n    I don’t even have the Tidio app on my phone because I trust it to do its job.\n    \n        \n        \n          \n              Daniel Reid               Co-founder and CEO of Suitor           \n    \n    \n    \n\n\n\nThe experience is everything\n\n\n\nWith Tidio’s 24/7 support, Suitor gained a competitive advantage over its competitors. The suit rental company discovered that people prefer to use AI to static bots and more customers are open to talking to intelligent chatbots.\n\n\n\nSuitor uses Tidio every day, which has saved them money and time while increasing the company’s revenue and owners’ happiness. On top of that, customers leave feedback praising the experience. And when customers are happy, the business tends to grow exponentially. \n\n\n\n\n\n    We’ve had big revenue growth [this year] and Tidio is a large part of why we’re growing. It’s a massive part of our customer experience.\n    \n        \n        \n          \n              Daniel Reid               Co-founder and CEO of Suitor           \n    \n    \n    \n\n\n\nAI can help you save time and money as well. So, why not start automating your business today?\n\n\n\n\n    \n        \n            Let’s talk about how we can help to achieve your goals\n        \n\n        \n            \n                    Get started for free            \n\n                            \n                        Get a demo                \n                    \n                \n                Learn more about AI chatbots        \n            \n\nShare this article:Beata StefanowiczContent Writer at Tidio with a love for the written word. She scouts around for digital trends and ways to help small and medium businesses grow.Follow me onSimilar articlesAd Hoc Atelier Boosts Conversions Using Tidio Live ChatCase StudiesProcosmet Lead Generation Surges After Installing TidioCase StudiesShockbyte Slashes Response Times With Tidio FlowsCase StudiesNever Leave Your Customer Without an AnswerTry Tidio for freeTidio>Case Studies>Suitor Hits 85% Customer Service Automation With LyroTidioAbout usContactPartner ProgramsJobs – We're hiring!SecurityStatus PageProductPricingLyro AI ChatbotLive ChatFlowsHelp DeskTidio+All featuresProduct UpdatesIntegrationsShopifyWordPressAll platformsMessengerInstagramWhatsAppAll appsResourcesAll ResourcesBlogCase StudiesHelp CenterTidio vs. GorgiasTidio vs. IntercomTidio vs. LiveChatTidio vs. ZendeskHelp CenterInstallationGet StartedIntegrationsFlows setupDevelopers★★★★★★★★★★4.7 on Shopify4.7 on G24.8 on CapterraJoin 300k+ businesses that use TidioImprove your business with sales, support, and customer service automationGet started freeAvailable on:BrowserAndroidiOSWindowsMacCHATBOTBest AI ChatbotsHow to Create a ChatbotBest Chatbot AppsBest Chatbot BuildersBest AI Chatbot PlatformsLIVE CHATFree Live Chat SoftwareHow to Add Live Chat to a WebsiteEcommerce Live ChatBest Live Chat SoftwareLive Chat for SalesCUSTOMER SERVICEBest Help Desk SoftwareChat Widgets for WebsitesLive Chat for Customer ServiceWordPress Chatbot PluginsCustomer Service ChatbotsSALESEcommerce Chatbots Real Estate ChatbotsSales ChatbotsChatbots for BusinessBest Real Life ChatbotsPLATFORMSShopify Live Chat AppsShopify Chatbot AppsWordPress Chat PluginsSquarespace Chat PluginsMagento Live Chat ExtensionsCHANNELSInstagram ChatbotsFacebook Messenger ChatbotWhatsApp ChatbotInstagram Bots for ReactionsWhatsApp AutomationsTidio 2024. All rights reserved.Privacy PolicyTerms and ConditionsDo not sell and share my datasupport@tidio.net"
}