{
  "url": "https://www.tidio.com/blog/lyro-case-study/",
  "data": "<iframe src=\"https://www.googletagmanager.com/ns.html?id=GTM-TFKGCT9\" height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe>Meet Lyro AI Chatbot - Solve up to 70% of customer problems with AILog inProductLyro AI ChatbotHelp Desk & Live ChatFlowsIntegrationsSee all Tidio featuresLyro AI ChatbotLearn more about Lyro AI ChatbotCase studiesBella SanteSuitorTidio SupportResourcesAI Chatbot BattlesTidio Academy courseHelp Desk & Live ChatLearn more about Help DeskFeaturesLive ChatTicketingMultichannelResourcesHelp Desk ChecklistBest PracticesFlowsLearn more about FlowsPlaybooksReplicate In-store Shopping OnlineWin Leads and Sales with Automation & AIEcommerce hubFlows ROI CalculatorSales Tactics for Ecommerce GrowthIntegrationsLearn more about AnalyticsPlatformsShopifyWordPressSee all integrationsChannelsWhatsappInstagramMessengerWatch DemoContact SalesLyro AI ChatbotWin up to 70% of your team’s time back. Automatically answer common questions and perform recurring tasks with AI.Learn more about Lyro AI ChatbotCase studiesBella SanteSuitorTidio SupportResourcesAI Chatbot BattlesTidio Academy courseHelp DeskDrive customer satisfaction with live chat, ticketing, video calls, and multichannel communication - everything you need for customer service.Learn more about Help DeskFeaturesLive ChatTicketingMultichannelResourcesHelp Desk ChecklistBest PracticesFlowsBoost your lead gen and sales funnels with Flows - no-code automation paths that trigger at crucial moments in the customer journey.Learn more about FlowsPlaybooksReplicate In-store Shopping OnlineWin Leads and Sales with Automation & AIEcommerce hubFlows ROI CalculatorSales Tactics for Ecommerce GrowthAnalyticsKeep track of the data that matters to your business. Monitor the performance of your team, Lyro AI Chatbot, and Flows.Learn more about AnalyticsPlatformsShopifyWordPressSee all integrationsChannelsWhatsappInstagramMessengerSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesPricingEcommerceResourcesCustomer StoriesLearnCompareHelp CenterBlogSee all ResourcesCustomer StoriesNewest case studyeye-oo Boosts Revenue by €177K+ After Installing TidioDiscover how this Shopify store used Tidio to offer better service, recover carts, and boost sales.Customer StoriesADT Security Service Improves CSAT by 30% Using TidioBella Santé Adds $66K+ to Revenue with Lyro AI ChatbotEndeksa’s Lead Generation Grows by 138% with Tidio FlowsSee allLearnTidio AcademyTidio AcademyPropel your customer service to the next level with Tidio’s free courses.PlaybooksReplicate In-store Shopping OnlineHow to Leverage AI in Customer ServiceWin Leads and Sales with Automation & AISee all PlaybooksGuidesSales Tactics for Ecommerce GrowthThe Successful Help Desk ChecklistResourcesPodcastsFlows ROI CalculatorSee all ResourcesCompareCompare TidioTidio vs GorgiasTidio vs IntercomTidio vs LiveChatTidio vs ZendeskAI ShowdownLyro vs ZowieLyro vs AdaLearn more about Lyro AI ChatbotOther comparisonsAI Customer Support: 10 Best SolutionsBest WordPress Chat PluginsTop 10 Shared Inbox ToolsTop 8 Squarespace Chat PluginsHelp CenterGo to Help CenterSetupInstall TidioGet startedWidget customizationManage Your ProjectUsing TidioLyro AI ChatbotFlowsHelp DeskTidio FeaturesOther ResourcesIntegrationsBilling & SubscriptionMobile & Desktop AppsNotificationsBlogGo to Tidio BlogChatbotsBest AI ChatbotsWordPress Chatbot PluginsShopify Chatbot AppsWooCommerce Chatbot PluginsHow to Create a ChatbotLive ChatFree Live Chat Software for WebsitesShopify Live Chat AppsSquarespace Chat PluginsLive Chat for Sales TeamsHow to Add Live Chat to a WebsiteTools for BusinessChatbots for EcommerceLive Chat for EcommerceChatbots for Sales and MarketingChatbots for Real EstateLive Chat for Customer ServiceNewest case studyeye-oo Boosts Revenue by €177K+ After Installing TidioDiscover how this Shopify store used Tidio to offer better service, recover carts, and boost sales.Customer StoriesSee allADT Security Service Improves CSAT by 30% Using TidioBella Santé Adds $66K+ to Revenue with Lyro AI ChatbotEndeksa’s Lead Generation Grows by 138% with Tidio FlowsTidio AcademyTidio AcademyPropel your customer service to the next level with Tidio’s free courses.PlaybooksReplicate In-store Shopping OnlineHow to Leverage AI in Customer ServiceWin Leads and Sales with Automation & AISee all PlaybooksGuidesSales Tactics for Ecommerce GrowthThe Successful Help Desk ChecklistResourcesPodcastsFlows ROI CalculatorSee all ResourcesCompare TidioTidio vs GorgiasTidio vs IntercomTidio vs LiveChatTidio vs ZendeskAI ShowdownLyro vs ZowieLyro vs AdaLearn more about Lyro AI ChatbotOther comparisonsAI Customer Support: 10 Best SolutionsBest WordPress Chat PluginsTop 10 Shared Inbox ToolsTop 8 Squarespace Chat PluginsHelp CenterHit the ground running - Master Tidio quickly with our extensive resource library. Learn about features, customize your experience, and find out how to set up integrations and use our apps.Go to Help CenterSetupInstall TidioGet startedWidget customizationManage Your ProjectUsing TidioLyro AI ChatbotFlowsHelp DeskTidio FeaturesOther ResourcesIntegrationsBilling & SubscriptionMobile & Desktop AppsNotificationsTidio BlogKeep up with emerging trends in customer service and learn from top industry experts. Master Tidio with in-depth guides and uncover real-world success stories in our case studies. Discover the blueprint for exceptional customer experiences and unlock new pathways for business success.Go to Tidio BlogChatbotsBest AI ChatbotsWordPress Chatbot PluginsShopify Chatbot AppsWooCommerce Chatbot PluginsHow to Create a ChatbotLive ChatFree Live Chat Software for WebsitesShopify Live Chat AppsSquarespace Chat PluginsLive Chat for Sales TeamsHow to Add Live Chat to a WebsiteTools for BusinessChatbots for EcommerceLive Chat for EcommerceChatbots for Sales and MarketingChatbots for Real EstateLive Chat for Customer ServicePartnersLet's TalkPartner ProgramsFind a trusted agencyPartner portalContactSee Tidio in actionContact salesGet started freeTidio>Blog>Case StudiesTidio Support Team Achieves 58% Automation With Lyroby Beata Stefanowicz·Updated Jul 11, 2024Discover how Lyro can help you grow your businessGet LyroLearn more\n\n\n\n\nLyro is Tidio’s AI chatbot, powered by Antrophic’s Claude LLM (large language model) and Tidio’s in-house AI mechanism, which controls what the model learns and says.\n\n\n\nIt uses deep learning techniques to understand, predict, and generate human-like content while Claude LLM ensures that the trained AI is honest, helpful, and harmless. This makes the model one of the most secure AI algorithms available on the market. Lyro also doesn’t allow for “AI hallucinations” and always keeps to the information from the company’s knowledge base. \n\n\n\nLast year, we published a case study highlighting how our support team leveraged Lyro to enhance customer support operations prior to its launch to the public. Since then, significant developments and improvements have been made, including the adoption of the new Claude 3 version. \n\n\n\nBut first, let’s discover a bit more about Tidio.\n\n\n\nDemocratizing AI for customer service\n\n\n\n\n\n\n\nTidio is an all-in-one customer experience tool that helps small and medium businesses grow and automate their customer service. The software combines live chat with the power of chatbots to speed up processes and automate repetitive tasks.\n\n\n\nTidio’s customer experience agents aim to work effectively as a team, respond to a large volume of messages, and maintain the highest possible quality of customer support. The team also wants to demonstrate that they can generate additional revenue for the business.\n\n\n\nSo, how did our team experience the changes in the system?\n\n\n\nHow Lyro solves customer service challenges\n\n\n\nThe biggest challenge of the support team is about keeping the best possible quality while meeting the service level agreement (SLA). Moreover, as shoppers are tired of the robotic customer service, long waiting times, and constantly repeating their issues, personalization is more important than ever before. And Lyro is here to help. \n\n\n\nBut that’s not all. \n\n\n\nSupport teams don’t have the time to teach the software what exactly it needs to do. Well—they don’t have to anymore. \n\n\n\nLyro helps support teams save time and automate replies without the need to code a single line. You also don’t need to worry about training the system. It trains itself on your company data including question-answer pairs from the knowledge base and previous conversations. \n\n\n\n\n\n\n\n\n\n\n\n    We are positively surprised by how drastic the changes on the Claude 3 are. The most visible difference is seen primarily in complicated/long questions. Lyro is now able to cover all of the questions more precisely, often providing several possible solutions to a query (if more solutions/options are available), or offering step-by-step guidelines.\n    \n        \n        \n          \n              Olek Potrykus              Head of Customer Experience at Tidio           \n    \n    \n    \n\n\n\nSounds too good to be true? \n\n\n\nOur customer service team puts it to the test daily, so let’s check out what they found.\n\n\n\nLyro automates responses to customer queries\n\n\n\nThe new version of Lyro achieved a success rate between 79% and 87% in comparison to the early version which only reached 50% to 70%. The variation in the new Lyro depended on the type of question asked and whether simple replies were included, along with the system responding to simple “Hello” messages.\n\n\n\n\n\n\n\nAnother great benefit of this software is that the risk of hallucination is minimal and Tidio is training it to stick to the results from the FAQs and the knowledge base. This will help businesses in the future to ensure the responses are on track.\n\n\n\n\n\n    The quality of conversations drastically improved when we moved Lyro to Claude 3. Lyro is more precise now and provides more elaborated and well-constructed replies.\n    \n        \n        \n          \n              Olek Potrykus              Head of Customer Experience at Tidio           \n    \n    \n    \n\n\n\nIt slashes first response time \n\n\n\nAfter Tidio’s customer service team started using Lyro, the first response time dropped by 75% from 1 minute to less than 15 seconds. That’s a huge decrease that can improve your customer satisfaction since you’re not making your shoppers wait. \n\n\n\nOn top of that, fast replies can help you secure a sale if a visitor comes to you with a sale-related question. Being quick pays off.\n\n\n\n\n\n\n\n\n\n    Lyro has been a real game changer for us. Our first response time dropped from 1 minute, which is an industry standard, to less than 15 seconds!\n    \n        \n        \n          \n              Olek Potrykus              Head of Customer Experience at Tidio           \n    \n    \n    \n\n\n\nIt boosts satisfaction\n\n\n\nThe experience with the rule-based chatbots resembles a dial helpline where you pick 1 for topic A, 2 for topic B, etc. On the other hand, the conversational AI leads the chat in a natural language, learns from each communication with users, and remembers the context of the whole conversation.\n\n\n\n\n\n\n\nThat’s what makes Lyro so great—the way it can chat with customers as if it were human.\n\n\n\n\n\n    The previous generation of chatbots required a method of communication that is unnatural to humans. Lyro allows us to use the power of LLM.\n    \n        \n        \n          \n              Olek Potrykus              Head of Customer Experience at Tidio           \n    \n    \n    \n\n\n\nTwo approaches our team conducts and recommends for anyone using Lyro are:\n\n\n\n\nKeeping all the information in Lyro’s FAQ up-to-date, including the product and pricing changes\n\n\n\nRegularly analyzing Lyro’s conversations and checking the Suggestions tab to see all the questions that Lyro was unable to answer\n\n\n\n\nRead more: Learn the tips and best practices for training Lyro AI.\n\n\n\nGain more time leveraging AI\n\n\n\nSince implementing Lyro, support agents have more time to focus on achieving customer satisfaction and bringing more value to the clients. They can do it by removing obstacles reactively and proactively, as well as showing users the full potential of the products.\n\n\n\nSo, try it out yourself and see how Lyro can help you grow your business and achieve a frictionless customer experience.\n\n\n\n\n    \n        \n            Take Lyro for a spin using the free 50 conversations\n        \n\n        \n            \n                    Get started for free            \n\n                            \n                        Get a demo                \n                    \n                \n                Learn more about AI chatbots        \n            \n\nShare this article:Beata StefanowiczContent Writer at Tidio with a love for the written word. She scouts around for digital trends and ways to help small and medium businesses grow.Follow me onSimilar articlesAd Hoc Atelier Boosts Conversions Using Tidio Live ChatCase StudiesLaunching Tidio AI to Empower SMBs With AI FeaturesReleases and updates22 Best AI Chatbots for 2024 [ChatGPT & Alternatives]ChatbotsNever Leave Your Customer Without an AnswerTry Tidio for freeTidio>Case Studies>Tidio Support Team Achieves 58% Automation With LyroTidioAbout usContactPartner ProgramsJobs – We're hiring!SecurityStatus PageProductPricingLyro AI ChatbotLive ChatFlowsHelp DeskTidio+All featuresProduct UpdatesIntegrationsShopifyWordPressAll platformsMessengerInstagramWhatsAppAll appsResourcesAll ResourcesBlogCase StudiesHelp CenterTidio vs. GorgiasTidio vs. IntercomTidio vs. LiveChatTidio vs. ZendeskHelp CenterInstallationGet StartedIntegrationsFlows setupDevelopers★★★★★★★★★★4.7 on Shopify4.7 on G24.8 on CapterraJoin 300k+ businesses that use TidioImprove your business with sales, support, and customer service automationGet started freeAvailable on:BrowserAndroidiOSWindowsMacCHATBOTBest AI ChatbotsHow to Create a ChatbotBest Chatbot AppsBest Chatbot BuildersBest AI Chatbot PlatformsLIVE CHATFree Live Chat SoftwareHow to Add Live Chat to a WebsiteEcommerce Live ChatBest Live Chat SoftwareLive Chat for SalesCUSTOMER SERVICEBest Help Desk SoftwareChat Widgets for WebsitesLive Chat for Customer ServiceWordPress Chatbot PluginsCustomer Service ChatbotsSALESEcommerce Chatbots Real Estate ChatbotsSales ChatbotsChatbots for BusinessBest Real Life ChatbotsPLATFORMSShopify Live Chat AppsShopify Chatbot AppsWordPress Chat PluginsSquarespace Chat PluginsMagento Live Chat ExtensionsCHANNELSInstagram ChatbotsFacebook Messenger ChatbotWhatsApp ChatbotInstagram Bots for ReactionsWhatsApp AutomationsTidio 2024. All rights reserved.Privacy PolicyTerms and ConditionsDo not sell and share my datasupport@tidio.net"
}