{
  "url": "https://www.swank12.com/privacy.html#",
  "data": "Home\n\t\t\t\t\tAbout Us\n\t\t\t\t\tSolutions\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tFIG\n\t\t\t\t\t\t\tK-12 CONSULTING\n\t\t\t\t\t\t\tBUSINESS AUTOMATION\n\t\t\t\t\t\t\tCONTENT MANAGEMENT\n\t\t\t\t\t\t\tBALANCE BUDDY\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\tPARTNERS, PROJECTS\n\t\t\t\t\tEMPLOYEE RESOURCES\n\t\t\t\t\tCAREERS\n\t\t\t\t\tPRIVACY\n\t\t\t\t\tContact\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t  \n\t\t\t\t  \n\t\t\t\t  \n\t\t\t\t\n\t\t\t\n\t\t\t\t\t\t\n\t\t        \n\t\t        \n\t\t        \n\t\t      \n\t\t\n\t\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\n\t\t\t\tPrivacy Policy\n\t\t\t\tWelcome to Swan Solutions, a leading provider of web development services, portals, and custom applications designed specifically for K-12 nutrition districts and companies. We are passionate about leveraging technology to transform the way nutrition programs operate and enhance the well-being of students. Here’s what sets Swan Solutions apart:\n\t\t\t\n\t\t\n\t\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\tPrivacy Policy\n\t\t\t\t\tProtecting your private information is our priority. This Statement of Privacy applies to  AR Development Holdings, Inc. and governs data collection and usage. For the purposes of this Privacy Policy, unless otherwise noted, all references to AR Development Holdings, Inc. include  The Fig App. The The Fig App website is a social media and professional development site. By using the The Fig App website, you consent to the data practices described in this statement.\n\t\t\t\t\tCollection of your Personal Infomation\n\t\t\t\t\tIn order to better provide you with products and services offered, The Fig App may collect personally identifiable information, such as your\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tFirst and Last Name\n\t\t\t\t\t\t\tMailing Address\n\t\t\t\t\t\t\tE-mail Address\n\t\t\t\t\t\t\tPhone Number\n\t\t\t\t\t\t\tEmployer\n\t\t\t\t\t\t\tJob Title\n\t\t\t\t\t\t\n\t\t\t\t\tIf you purchase The Fig App’s products and services, we collect billing and credit card information. This information is used to complete the purchase transaction. Please keep in mind that if you directly disclose personally identifiable information or personally sensitive data through The Fig App’s public message boards, this information may be collected and used by others.\n\t\t\t\t\tWe do not collect any personal information about you unless you voluntarily provide it to us. However, you may be required to provide certain personal information to us when you elect to use certain products or services. These may include: (a) registering for an account; (b) entering a sweepstakes or contest sponsored by us or one of our partners; (c) signing up for special offers from selected third parties; (d) sending us an email message; (e) submitting your credit card or other payment information when ordering and purchasing products and services. To wit, we will use your information for, but not limited to, communicating with you in relation to services and/or products you have requested from us. We also may gather additional personal or non-personal information in the future.\n\t\t\t\t\t\n\t\t\t\t\tUse of your Personal Information\n\t\t\t\t\tThe Fig App collects and uses your personal information to operate and deliver the services you have requested.\n\t\t\t\t\tThe Fig App may also use your personally identifiable information to inform you of other products or services available from The Fig App and its affiliates.\n\t\t\t\t\tSharing Information with Third Parties\n\t\t\t\t\tThe Fig App does not sell, rent or lease its customer lists to third parties.\n\t\t\t\t\tThe Fig App may, from time to time, contact you on behalf of external business partners about a particular offering that may be of interest to you. In those cases, your unique personally identifiable information (e-mail, name, address, telephone number) is transferred to the third party. The Fig App may share data with trusted partners to help perform statistical analysis, send you email or postal mail, provide customer support, or arrange for deliveries. All such third parties are prohibited from using your personal information except to provide these services to The Fig App, and they are required to maintain the confidentiality of your information.\n\t\t\t\t\tThe Fig App may disclose your personal information, without notice, if required to do so by law or in the good faith belief that such action is necessary to: (a) conform to the edicts of the law or comply with legal process served on The Fig App or the site; (b) protect and defend the rights or property of The Fig App; and/or (c) act under exigent circumstances to protect the personal safety of users of The Fig App, or the public.\n\t\t\t\t\tOpt-Out of Disclosure of Personal Information to Third Parties\n\t\t\t\t\tIn connection with any personal information we may disclose to a third party for a business purpose, you have the right to know:\n\n\t\t\t\t\tThe categories of personal information that we disclosed about you for a business purpose.\n\t\t\t\t\tYou have the right under the California Consumer Privacy Act of 2018 (CCPA) and certain other privacy and data protection laws, as applicable, to opt-out of the disclosure of your personal information. If you exercise your right to opt-out of the disclosure of your personal information, we will refrain from disclosing your personal information, unless you subsequently provide express authorization for the disclosure of your personal information. To opt-out of the disclosure of your personal information, visit this Web page www.thefigapp.com.\n\t\t\t\t\tTracking User Behavior\n\t\t\t\t\tThe Fig App may keep track of the websites and pages our users visit within The Fig App, in order to determine what The Fig App services are the most popular. This data is used to deliver customized content and advertising within The Fig App to customers whose behavior indicates that they are interested in a particular subject area.\n\t\t\t\t\tAutomatically Collected Information\n\t\t\t\t\tInformation about your computer hardware and software may be automatically collected by The Fig App. This information can include: your IP address, browser type, domain names, access times and referring website addresses. This information is used for the operation of the service, to maintain quality of the service, and to provide general statistics regarding use of the The Fig App website.\n\t\t\t\t\tLinks\n\t\t\t\t\tThis website contains links to other sites. Please be aware that we are not responsible for the content or privacy practices of such other sites. We encourage our users to be aware when they leave our site and to read the privacy statements of any other site that collects personally identifiable information.\n\t\t\t\t\tSecurity of your Personal Information\n\t\t\t\t\tThe Fig App secures your personal information from unauthorized access, use, or disclosure. The Fig App uses the following methods for this purpose:\n\n\t\t\t\t\tSSL Protocol\n\t\t\t\t\tWhen personal information (such as a credit card number) is transmitted to other websites, it is protected through the use of encryption, such as the Secure Sockets Layer (SSL) protocol.\n\n\t\t\t\t\tWe strive to take appropriate security measures to protect against unauthorized access to or alteration of your personal information. Unfortunately, no data transmission over the Internet or any wireless network can be guaranteed to be 100% secure. As a result, while we strive to protect your personal information, you acknowledge that: (a) there are security and privacy limitations inherent to the Internet which are beyond our control; and (b) security, integrity, and privacy of any and all information and data exchanged between you and us through this Site cannot be guaranteed.\n\t\t\t\t\tRight to Deletion\n\t\t\t\t\tSubject to certain exceptions set out below, on receipt of a verifiable request from you, we will:\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tDelete your personal information from our records; and\n\t\t\t\t\t\t\tDirect any service providers to delete your personal information from their records.\n\t\t\t\t\t\t\n\t\t\t\t\tPlease note that we may not be able to comply with requests to delete your personal information if it is necessary to:\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tComplete the transaction for which the personal information was collected, fulfill the terms of a written warranty or product recall conducted in accordance with federal law, provide a good or service requested by you, or reasonably anticipated within the context of our ongoing business relationship with you, or otherwise perform a contract between you and us;\n\t\t\t\t\t\t\tDetect security incidents, protect against malicious, deceptive, fraudulent, or illegal activity; or prosecute those responsible for that activity;\n\t\t\t\t\t\t\tDebug to identify and repair errors that impair existing intended functionality;\n\t\t\t\t\t\t\tExercise free speech, ensure the right of another consumer to exercise his or her right of free speech, or exercise another right provided for by law;\n\t\t\t\t\t\t\tComply with the California Electronic Communications Privacy Act;\n\t\t\t\t\t\t\tEngage in public or peer-reviewed scientific, historical, or statistical research in the public interest that adheres to all other applicable ethics and privacy laws, when our deletion of the information is likely to render impossible or seriously impair the achievement of such research, provided we have obtained your informed consent;\n\t\t\t\t\t\t\tEnable solely internal uses that are reasonably aligned with your expectations based on your relationship with us;\n\t\t\t\t\t\t\tComply with an existing legal obligation; or\n\t\t\t\t\t\t\tOtherwise use your personal information, internally, in a lawful manner that is compatible with the context in which you provided the information.\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\tChildren Under Thirteen\n\t\t\t\t\tThe Fig App does not knowingly collect personally identifiable information from children under the age of thirteen. If you are under the age of thirteen, you must ask your parent or guardian for permission to use this website.\n\t\t\t\t\tOpt-Out & Unsubscribe from Third Party Communications\n\t\t\t\t\tWe respect your privacy and give you an opportunity to opt-out of receiving announcements of certain information. Users may opt-out of receiving any or all communications from third-party partners of The Fig App by contacting us here:\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tWeb page:www.thefigapp.com\n\t\t\t\t\t\t\tEmail:Grow@TheFigApp.net\n\t\t\t\t\t\t\tPhone:770-853-9289\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\tE-mail Communications\n\t\t\t\t\tFrom time to time, The Fig App may contact you via email for the purpose of providing announcements, promotional offers, alerts, confirmations, surveys, and/or other general communication. In order to improve our Services, we may receive a notification when you open an email from The Fig App or click on a link therein.\n\t\t\t\t\tIf you would like to stop receiving marketing or promotional communications via email from The Fig App, you may opt out of such communications by clicking the UNSUBSCRIBE button..\n\t\t\t\t\tChanges to this Statement\n\t\t\t\t\tThe Fig App reserves the right to change this Privacy Policy from time to time. We will notify you about significant changes in the way we treat personal information by sending a notice to the primary email address specified in your account, by placing a prominent notice on our website, and/or by updating any privacy information. Your continued use of the website and/or Services available after such modifications will constitute your: (a) acknowledgment of the modified Privacy Policy; and (b) agreement to abide and be bound by that Policy.\n\t\t\t\t\tContact Information\n\t\t\t\t\tThe Fig App welcomes your questions or comments regarding this Statement of Privacy. If you\n\t\t\t\t\tbelieve that The Fig App has not adhered to this Statement, please contact The Fig App at:\n\n\t\t\t\t\tAR Development Holdings, Inc.\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t3460 Quail Dr.\n\t\t\t\t\tPace, Florida 32571\n\t\t\t\t\tEmail Address:\n\t\t\t\t\tbecki@swansolutionsllc.com\n\t\t\t\t\tTelephone number:  \n\t\t\t\t\tPrivacy Policy\n\t\t\t\t\tProtecting your private information is our priority. This Statement of Privacy applies to  AR Development Holdings, Inc. and governs data collection and usage. For the purposes\n\t\t\t\t\tof this Privacy Policy, unless otherwise noted, all references to AR Development Holdings, Inc.\n\t\t\t\t\tinclude  Swan Solutions. The Swan Solutions website is a social media and\n\t\t\t\t\tprofessional development site. By using the Swan Solutions website, you consent to the data\n\t\t\t\t\tpractices described in this statement.\n\t\t\t\t\t\n\t\t\t\t\tCollection of your Personal Information\n\t\t\t\t\t\n\t\t\t\t\t\tIn order to better provide you with products and services offered, Swan Solutions may collect personally identifiable information, such as your\n\n\t\t\t\t\t· First and Last Name\n\t\t\t\t\t· Mailing Address\n\t\t\t\t\t· E-mail Address\n\t\t\t\t\t· Phone Number\n\t\t\t\t\t· Employer\n\t\t\t\t\t· Job Title\n\n\t\t\t\t\tIf you purchase Swan Solutions’s products and services, we collect billing and credit card information. This information is used to complete the purchase transaction.\n\t\t\t\t\tPlease keep in mind that if you directly disclose personally identifiable information or personally sensitive data through Swan Solutions’s public message boards, this information may be collected and used by others.\n\t\t\t\t\tWe do not collect any personal information about you unless you voluntarily provide it to us. However, you may be required to provide certain personal information to us when you elect to use certain products or services. These may include: (a) registering for an account; (b) entering a sweepstakes or contest sponsored by us or one of our partners; (c) signing up for special offers from selected third parties; (d) sending us an email message; (e) submitting your credit card or other payment information when ordering and purchasing products and services. To wit, we will use your information for, but not limited to, communicating with you in relation to services and/or products you have requested from us. We also may gather additional personal or non-personal information in the future.\n\t\t\t\t\t\n\t\t\t\t\tUse of your Personal Information\n\t\t\t\t\tSwan Solutions collects and uses your personal information to operate and deliver the services you have requested.\n\t\t\t\t\tSwan Solutions may also use your personally identifiable information to inform you of other products or services available from Swan Solutions and its affiliates.\n\t\t\t\t\tSharing Information with Third Parties\n\t\t\t\t\t\n\t\t\t\t\t\tSwan Solutions does not sell, rent or lease its customer lists to third parties.\n\t\t\t\t\tSwan Solutions may, from time to time, contact you on behalf of external business partners about a particular offering that may be of interest to you. In those cases, your unique personally identifiable information (e-mail, name, address, telephone number) is transferred to the third party. Swan Solutions may share data with trusted partners to help perform statistical analysis, send you email or postal mail, provide customer support, or arrange for deliveries. All such third parties are prohibited from using your personal information except to provide these services to Swan Solutions, and they are required to maintain the confidentiality of your information.\n\t\t\t\t\tSwan Solutions may disclose your personal information, without notice, if required to do so by law or in the good faith belief that such action is necessary to: (a) conform to the edicts of the law or comply with legal process served on Swan Solutions or the site; (b) protect and defend the rights or property of Swan Solutions; and/or (c) act under exigent circumstances to protect the personal safety of users of Swan Solutions, or the public.\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\tOpt-Out of Disclosure of Personal Information to Third Parties\n\t\t\t\t\tIn connection with any personal information we may disclose to a third party for a business purpose, you have the right to know:\n\n\t\t\t\t\t·The categories of personal information that we disclosed about you for a business purpose.\n\n\t\t\t\t\tYou have the right under the California Consumer Privacy Act of 2018 (CCPA) and certain other privacy and data protection laws, as applicable, to opt-out of the disclosure of your personal information. If you exercise your right to opt-out of the disclosure of your personal information, we will refrain from disclosing your personal information, unless you subsequently provide express authorization for the disclosure of your personal information. To opt-out of the disclosure of your personal information, visit this Web page www.thefigapp.com.\n\t\t\t\t\tTracking User Behavior\n\t\t\t\t\tSwan Solutions may keep track of the websites and pages our users visit within Swan Solutions, in order to determine what Swan Solutions services are the most popular. This data is used to deliver customized content and advertising within Swan Solutions to customers whose behavior indicates that they are interested in a particular subject area.\n\t\t\t\t\tAutomatically Collected Information\n\t\t\t\t\tInformation about your computer hardware and software may be automatically collected by Swan Solutions. This information can include: your IP address, browser type, domain names, access times and referring website addresses. This information is used for the operation of the service, to maintain quality of the service, and to provide general statistics regarding use of the Swan Solutions website.\n\t\t\t\t\tLinks\n\t\t\t\t\tThis website contains links to other sites. Please be aware that we are not responsible for the content or privacy practices of such other sites. We encourage our users to be aware when they leave our site and to read the privacy statements of any other site that collects personally identifiable information.\n\t\t\t\t\tSecurity of your Personal Information\n\t\t\t\t\tSwan Solutions secures your personal information from unauthorized access, use, or disclosure. Swan Solutions uses the following methods for this purpose:\n\n\t\t\t\t\t· SSL Protocol\n\n\t\t\t\t\tWhen personal information (such as a credit card number) is transmitted to other websites, it is protected through the use of encryption, such as the Secure Sockets Layer (SSL) protocol.\n\t\t\t\t\t \n\n\t\t\t\t\tWe strive to take appropriate security measures to protect against unauthorized access to or alteration of your personal information. Unfortunately, no data transmission over the Internet or any wireless network can be guaranteed to be 100% secure. As a result, while we strive to protect your personal information, you acknowledge that: (a) there are security and privacy limitations inherent to the Internet which are beyond our control; and (b) security, integrity, and privacy of any and all information and data exchanged between you and us through this Site cannot be guaranteed.\n\t\t\t\t\tRight to Deletion\n\t\t\t\t\tSubject to certain exceptions set out below, on receipt of a verifiable request from you, we will:\n\t\t\t\t\t· Delete your personal information from our records; and\n\t\t\t\t\t· Direct any service providers to delete your personal information from their records.\n\t\t\t\t\tPlease note that we may not be able to comply with requests to delete your personal information if it is necessary to:\n\n\t\t\t\t\t· Complete the transaction for which the personal information was collected, fulfill the terms of a written warranty or product recall conducted in accordance with federal law, provide a good or service requested by you, or reasonably anticipated within the context of our ongoing business relationship with you, or otherwise perform a contract between you and us;\n\n\t\t\t\t\t· Detect security incidents, protect against malicious, deceptive, fraudulent, or illegal activity; or prosecute those responsible for that activity;\n\n\t\t\t\t\t· Debug to identify and repair errors that impair existing intended functionality;\n\n\t\t\t\t\t· Exercise free speech, ensure the right of another consumer to exercise his or her right of free speech, or exercise another right provided for by law;\n\n\t\t\t\t\t· Comply with the California Electronic Communications Privacy Act;\n\n\t\t\t\t\t· Engage in public or peer-reviewed scientific, historical, or statistical research in the public interest that adheres to all other applicable ethics and privacy laws, when our deletion of the information is likely to render impossible or seriously impair the achievement of such research, provided we have obtained your informed consent;\n\n\t\t\t\t\t· Enable solely internal uses that are reasonably aligned with your expectations based on your relationship with us;\n\n\t\t\t\t\t· Comply with an existing legal obligation; or\n\n\t\t\t\t\t· Otherwise use your personal information, internally, in a lawful manner that is compatible with the context in which you provided the information.\n\t\t\t\t\tChildren Under Thirteen\n\t\t\t\t\tSwan Solutions does not knowingly collect personally identifiable information from children under the age of thirteen. If you are under the age of thirteen, you must ask your parent or guardian for permission to use this website.\n\t\t\t\t\tOpt-Out & Unsubscribe from Third Party Communications\n\t\t\t\t\tWe respect your privacy and give you an opportunity to opt-out of receiving announcements of certain information. Users may opt-out of receiving any or all communications from third-party partners of Swan Solutions by contacting us here:\n\n\t\t\t\t\t· Web page: www.thefigapp.com\n\n\t\t\t\t\t· Email: Grow@TheFigApp.net\n\n\t\t\t\t\t· Phone: 770-853-9289\n\t\t\t\t\tE-mail Communications\n\t\t\t\t\tFrom time to time, Swan Solutions may contact you via email for the purpose of providing announcements, promotional offers, alerts, confirmations, surveys, and/or other general communication. In order to improve our Services, we may receive a notification when you open an email from Swan Solutions or click on a link therein.\n\t\t\t\t\tIf you would like to stop receiving marketing or promotional communications via email from Swan Solutions, you may opt out of such communications by clicking the UNSUBSCRIBE button..\t\n\t\t\t\t\tChanges to this Statement\n\t\t\t\t\tSwan Solutions reserves the right to change this Privacy Policy from time to time. We will notify you about significant changes in the way we treat personal information by sending a notice to the primary email address specified in your account, by placing a prominent notice on our website, and/or by updating any privacy information. Your continued use of the website and/or Services available after such modifications will constitute your: (a) acknowledgment of the modified Privacy Policy; and (b) agreement to abide and be bound by that Policy.\n\t\t\t\t\tContact Information\n\t\t\t\t\tSwan Solutions welcomes your questions or comments regarding this Statement of Privacy. If you\n\t\t\t\t\tbelieve that Swan Solutions has not adhered to this Statement, please contact Swan Solutions at:\n\n\t\t\t\t\tAR Development Holdings, Inc.\n\t\t\t\t\t\n\t\t\t\t\t\t3460 Quail Dr.\n\n\t\t\t\t\tPace, Florida 32571\n\n\t\t\t\t\tEmail Address:\n\t\t\t\t\tbecki@swansolutionsllc.com\n\n\t\t\t\t\tTelephone number:\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\t\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\n\t\t\t\tSubscribe Now\n\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\t\n\n\n\n\n\t\n\n\n\t\n\t\n\n\n\n\n\n\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\tAbout Us\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\tEmpowering Excellence through Elegance and Innovation At Swan Solutions, we are committed to providing cutting-edge technological solutions that empower businesses to excel in the modern digital landscape. \n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\tPAGES\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t Home\n\t\t\t\t\t\t About Us\n\t\t\t\t\t\t Services\n\t\t\t\t\t\t Contact\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\tHELP\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t About Us\n\t\t\t\t\t\t Partners, Projects\n\t\t\t\t\t\t Contact\n\t\t\t\t\t\t Privacy\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\tSOCIAL MEDIA\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\t\n\n\n\t\n\t\t\n\t\t\tCopyright © 2023 Swan Solutions - All Rights Reserved."
}