{
  "url": "https://www.tidio.com/blog/adt-case-study/",
  "data": "<iframe src=\"https://www.googletagmanager.com/ns.html?id=GTM-TFKGCT9\" height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe>Meet Lyro AI Chatbot - Solve up to 70% of customer problems with AILog inProductLyro AI ChatbotHelp Desk & Live ChatFlowsIntegrationsSee all Tidio featuresLyro AI ChatbotLearn more about Lyro AI ChatbotCase studiesBella SanteSuitorTidio SupportResourcesAI Chatbot BattlesTidio Academy courseHelp Desk & Live ChatLearn more about Help DeskFeaturesLive ChatTicketingMultichannelResourcesHelp Desk ChecklistBest PracticesFlowsLearn more about FlowsPlaybooksReplicate In-store Shopping OnlineWin Leads and Sales with Automation & AIEcommerce hubFlows ROI CalculatorSales Tactics for Ecommerce GrowthIntegrationsLearn more about AnalyticsPlatformsShopifyWordPressSee all integrationsChannelsWhatsappInstagramMessengerWatch DemoContact SalesLyro AI ChatbotWin up to 70% of your team’s time back. Automatically answer common questions and perform recurring tasks with AI.Learn more about Lyro AI ChatbotCase studiesBella SanteSuitorTidio SupportResourcesAI Chatbot BattlesTidio Academy courseHelp DeskDrive customer satisfaction with live chat, ticketing, video calls, and multichannel communication - everything you need for customer service.Learn more about Help DeskFeaturesLive ChatTicketingMultichannelResourcesHelp Desk ChecklistBest PracticesFlowsBoost your lead gen and sales funnels with Flows - no-code automation paths that trigger at crucial moments in the customer journey.Learn more about FlowsPlaybooksReplicate In-store Shopping OnlineWin Leads and Sales with Automation & AIEcommerce hubFlows ROI CalculatorSales Tactics for Ecommerce GrowthAnalyticsKeep track of the data that matters to your business. Monitor the performance of your team, Lyro AI Chatbot, and Flows.Learn more about AnalyticsPlatformsShopifyWordPressSee all integrationsChannelsWhatsappInstagramMessengerSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesPricingEcommerceResourcesCustomer StoriesLearnCompareHelp CenterBlogSee all ResourcesCustomer StoriesNewest case studyeye-oo Boosts Revenue by €177K+ After Installing TidioDiscover how this Shopify store used Tidio to offer better service, recover carts, and boost sales.Customer StoriesADT Security Service Improves CSAT by 30% Using TidioBella Santé Adds $66K+ to Revenue with Lyro AI ChatbotEndeksa’s Lead Generation Grows by 138% with Tidio FlowsSee allLearnTidio AcademyTidio AcademyPropel your customer service to the next level with Tidio’s free courses.PlaybooksReplicate In-store Shopping OnlineHow to Leverage AI in Customer ServiceWin Leads and Sales with Automation & AISee all PlaybooksGuidesSales Tactics for Ecommerce GrowthThe Successful Help Desk ChecklistResourcesPodcastsFlows ROI CalculatorSee all ResourcesCompareCompare TidioTidio vs GorgiasTidio vs IntercomTidio vs LiveChatTidio vs ZendeskAI ShowdownLyro vs ZowieLyro vs AdaLearn more about Lyro AI ChatbotOther comparisonsAI Customer Support: 10 Best SolutionsBest WordPress Chat PluginsTop 10 Shared Inbox ToolsTop 8 Squarespace Chat PluginsHelp CenterGo to Help CenterSetupInstall TidioGet startedWidget customizationManage Your ProjectUsing TidioLyro AI ChatbotFlowsHelp DeskTidio FeaturesOther ResourcesIntegrationsBilling & SubscriptionMobile & Desktop AppsNotificationsBlogGo to Tidio BlogChatbotsBest AI ChatbotsWordPress Chatbot PluginsShopify Chatbot AppsWooCommerce Chatbot PluginsHow to Create a ChatbotLive ChatFree Live Chat Software for WebsitesShopify Live Chat AppsSquarespace Chat PluginsLive Chat for Sales TeamsHow to Add Live Chat to a WebsiteTools for BusinessChatbots for EcommerceLive Chat for EcommerceChatbots for Sales and MarketingChatbots for Real EstateLive Chat for Customer ServiceNewest case studyeye-oo Boosts Revenue by €177K+ After Installing TidioDiscover how this Shopify store used Tidio to offer better service, recover carts, and boost sales.Customer StoriesSee allADT Security Service Improves CSAT by 30% Using TidioBella Santé Adds $66K+ to Revenue with Lyro AI ChatbotEndeksa’s Lead Generation Grows by 138% with Tidio FlowsTidio AcademyTidio AcademyPropel your customer service to the next level with Tidio’s free courses.PlaybooksReplicate In-store Shopping OnlineHow to Leverage AI in Customer ServiceWin Leads and Sales with Automation & AISee all PlaybooksGuidesSales Tactics for Ecommerce GrowthThe Successful Help Desk ChecklistResourcesPodcastsFlows ROI CalculatorSee all ResourcesCompare TidioTidio vs GorgiasTidio vs IntercomTidio vs LiveChatTidio vs ZendeskAI ShowdownLyro vs ZowieLyro vs AdaLearn more about Lyro AI ChatbotOther comparisonsAI Customer Support: 10 Best SolutionsBest WordPress Chat PluginsTop 10 Shared Inbox ToolsTop 8 Squarespace Chat PluginsHelp CenterHit the ground running - Master Tidio quickly with our extensive resource library. Learn about features, customize your experience, and find out how to set up integrations and use our apps.Go to Help CenterSetupInstall TidioGet startedWidget customizationManage Your ProjectUsing TidioLyro AI ChatbotFlowsHelp DeskTidio FeaturesOther ResourcesIntegrationsBilling & SubscriptionMobile & Desktop AppsNotificationsTidio BlogKeep up with emerging trends in customer service and learn from top industry experts. Master Tidio with in-depth guides and uncover real-world success stories in our case studies. Discover the blueprint for exceptional customer experiences and unlock new pathways for business success.Go to Tidio BlogChatbotsBest AI ChatbotsWordPress Chatbot PluginsShopify Chatbot AppsWooCommerce Chatbot PluginsHow to Create a ChatbotLive ChatFree Live Chat Software for WebsitesShopify Live Chat AppsSquarespace Chat PluginsLive Chat for Sales TeamsHow to Add Live Chat to a WebsiteTools for BusinessChatbots for EcommerceLive Chat for EcommerceChatbots for Sales and MarketingChatbots for Real EstateLive Chat for Customer ServicePartnersLet's TalkPartner ProgramsFind a trusted agencyPartner portalContactSee Tidio in actionContact salesGet started freeTidio>Blog>Case StudiesADT Security Service Boosts Sales By 17% Using Tidioby Beata Stefanowicz·Updated Jan 18, 2024Use Tidio to grow your conversion ratesBook DemoGet started for free\n\n\n\n\nJodi Rell once said:\n\n\n\n“At the end of the day, the goals are simple: safety and security.”\n\n\n\nADT Security Service makes sure we feel safe when spending quality time with our loved ones and that our belongings are secure when we’re away from home. But to expand its reach and offer services to a broader audience, the company had to enhance the overall customer service experience.\n\n\n\nThe main challenge was to improve the response time to support questions, boost customer satisfaction on their website, and increase client retention. With the help of Tidio, the business implemented AI for faster response times, used analytics to understand user behavior, and presented offers in a conversational manner.\n\n\n\nLet’s see how they did it.\n\n\n\nThe security of your home in the palm of your hand\n\n\n\nInformation about the company\n\n\n\n\nIndustry: technology\n\n\n\nStarted year: 1874 \n\n\n\nSize: Presence in 50 countries\n\n\n\nCountry of origin/headquarters: Florida, USA\n\n\n\nTidio products/tactics used: chatbot filters and AI features\n\n\n\n\nAmerican District Telegraph (ADT) Security Service started in 1874 with the union of 57 district telegraph companies. This business is part of Johnson Controls, a leading global technology and multi-industrial group that develops diversified activities and serves a wide variety of clients in more than 150 countries. \n\n\n\nADT has been keeping belongings, assets, businesses, and homes safe around the world for more than a century as the global lead in security systems. People trust them with their most valuable assets, so being there for the clients is very important to ADT.\n\n\n\nThe challenges ADT Security Service faced\n\n\n\nThe trends that drove the company to look for a customer service tool included the need for faster response times, improved customer satisfaction, and increased retention. Before Tidio, ADT used a different tool, but it didn’t satisfy their needs. \n\n\n\nThe solution to this problem? \n\n\n\nLive chat and chatbots provided by Tidio.\n\n\n\n\n\n\n\nThe company uses AI functionality and chatbot department filters to improve customer service experience and cut costs. In fact, ADT chose Tidio because of the affordable pricing, easy control of the workflows, and chat specialist support.\n\n\n\nAnd now, they’re experiencing the benefits of the Tidio+ plan, such as lowered chat cost, simplified chat workflows, and redesigned automatic responses on the website.\n\n\n\n\n\n    I did web research and an analysis of the best chat tool solution for lead generation and client support, and Tidio seemed like the solution we were looking for\n    \n        \n        \n          \n              Cristina Verges Martinez               SEO specialist           \n    \n    \n    \n\n\n\nSo, let’s discover different ways in which Tidio helped this company improve.\n\n\n\n1. 30% boost in customer satisfaction\n\n\n\nWith Tidio, ADT Security managed to gain more control over the workflows and the support filters. This has helped the customer service team manage tickets efficiently, increasing overall client satisfaction. \n\n\n\nOn top of that, the managers have more insight into the tickets and can ensure the quality of service is kept high during the specialist chats.\n\n\n\nDuring this period, customer feedback revealed a notable 30% improvement in overall client satisfaction.\n\n\n\n\n\n\n\n2. Increased lead-to-sale conversion rates\n\n\n\nThree of the most important metrics ADT Security measures are the number of leads generated, the conversion rate, and the number of conversations handled. \n\n\n\nThe brand used Tidio to set up rule-based chatbots and filter conversions to departments in order to collect as well as classify leads more effectively.\n\n\n\n\n\n\n\nTidio has helped ADT boost lead generation up to about 30 prospects every week. The company also managed to boost the number of handled conversations by 45% while decreasing the number of missed conversations by 74%.\n\n\n\nOn top of that, they increased conversions from 44% to 61% using the service tool. Lead-to-sales conversions are crucial to ADT’s business growth, which makes the results stand out even more.\n\n\n\n3. 22% decrease in first response time\n\n\n\nThe average response time of ADT’s customer service was significantly higher than the industry standard. That’s when the managers knew they had to do something about it.\n\n\n\nAfter implementing Tidio, things started looking much brighter. The security company implemented AI chatbots on the website for faster response times and better classification of tickets to specific departments. \n\n\n\n\n\n    Compared with the last tool we used, we had the time of response down by 1 min\n    \n        \n        \n          \n              Cristina Verges Martinez               SEO specialist           \n    \n    \n    \n\n\n\nThe company’s average response time decreased by nearly 22% since using Tidio. And they keep working on optimizing the tool and cutting down the time it takes for users to get the answers they need.\n\n\n\n\n\n\n\nSuccess is within your reach\n\n\n\nCompared with other tools, the onboarding process with Tidio includes complete training of the tool. ADT staff members learned, in detail, about all the options and features they can use with the Tidio chat, how each one works, and the best way to use them. \n\n\n\nThe complete training is the first step towards success when it comes to implementing a new platform. \n\n\n\nAnd success has followed ADT right along. \n\n\n\nThe security company improved the efficiency of the workflows between the sales and client support departments. They also gathered the most frequently asked questions and doubts of the users from the chat conversations history. This helped the teams address customers’ pain points more quickly and effectively. On top of that, the A/B testing helped to nurture leads while making sure they became sales opportunities down the line.\n\n\n\n\n\n    In terms of flexibility, with Tidio, I have more specialized attention from the specialist chat, more control over the workflow, and more control over the client support filters.\n    \n        \n        \n          \n              Cristina Verges Martinez               SEO specialist           \n    \n    \n    \n\n\n\nWhy not start improving your customer service and growing leads today?\n\n\n\n\n    \n        \n            Check how Tidio can help you reach your business goals\n        \n\n        \n                Let’s chat!        \n        \n                \n                Learn more about Tidio Chatbot        \n            \n\nShare this article:Beata StefanowiczContent Writer at Tidio with a love for the written word. She scouts around for digital trends and ways to help small and medium businesses grow.Follow me onSimilar articlesShockbyte Slashes Response Times With Tidio FlowsCase StudiesSuitor Hits 85% Customer Service Automation With LyroCase StudiesEndeksa Hits 138% Boost in Lead Generation with TidioCase StudiesNever Leave Your Customer Without an AnswerTry Tidio for freeTidio>Case Studies>ADT Security Service Boosts Sales By 17% Using TidioTidioAbout usContactPartner ProgramsJobs – We're hiring!SecurityStatus PageProductPricingLyro AI ChatbotLive ChatFlowsHelp DeskTidio+All featuresProduct UpdatesIntegrationsShopifyWordPressAll platformsMessengerInstagramWhatsAppAll appsResourcesAll ResourcesBlogCase StudiesHelp CenterTidio vs. GorgiasTidio vs. IntercomTidio vs. LiveChatTidio vs. ZendeskHelp CenterInstallationGet StartedIntegrationsFlows setupDevelopers★★★★★★★★★★4.7 on Shopify4.7 on G24.8 on CapterraJoin 300k+ businesses that use TidioImprove your business with sales, support, and customer service automationGet started freeAvailable on:BrowserAndroidiOSWindowsMacCHATBOTBest AI ChatbotsHow to Create a ChatbotBest Chatbot AppsBest Chatbot BuildersBest AI Chatbot PlatformsLIVE CHATFree Live Chat SoftwareHow to Add Live Chat to a WebsiteEcommerce Live ChatBest Live Chat SoftwareLive Chat for SalesCUSTOMER SERVICEBest Help Desk SoftwareChat Widgets for WebsitesLive Chat for Customer ServiceWordPress Chatbot PluginsCustomer Service ChatbotsSALESEcommerce Chatbots Real Estate ChatbotsSales ChatbotsChatbots for BusinessBest Real Life ChatbotsPLATFORMSShopify Live Chat AppsShopify Chatbot AppsWordPress Chat PluginsSquarespace Chat PluginsMagento Live Chat ExtensionsCHANNELSInstagram ChatbotsFacebook Messenger ChatbotWhatsApp ChatbotInstagram Bots for ReactionsWhatsApp AutomationsTidio 2024. All rights reserved.Privacy PolicyTerms and ConditionsDo not sell and share my datasupport@tidio.net"
}