{
  "url": "https://www.tidio.com/blog/gecko-hospitality-case-study/",
  "data": "<iframe src=\"https://www.googletagmanager.com/ns.html?id=GTM-TFKGCT9\" height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe>Meet Lyro AI Chatbot - Solve up to 70% of customer problems with AILog inProductLyro AI ChatbotHelp Desk & Live ChatFlowsIntegrationsSee all Tidio featuresLyro AI ChatbotLearn more about Lyro AI ChatbotCase studiesBella SanteSuitorTidio SupportResourcesAI Chatbot BattlesTidio Academy courseHelp Desk & Live ChatLearn more about Help DeskFeaturesLive ChatTicketingMultichannelResourcesHelp Desk ChecklistBest PracticesFlowsLearn more about FlowsPlaybooksReplicate In-store Shopping OnlineWin Leads and Sales with Automation & AIEcommerce hubFlows ROI CalculatorSales Tactics for Ecommerce GrowthIntegrationsLearn more about AnalyticsPlatformsShopifyWordPressSee all integrationsChannelsWhatsappInstagramMessengerWatch DemoContact SalesLyro AI ChatbotWin up to 70% of your team’s time back. Automatically answer common questions and perform recurring tasks with AI.Learn more about Lyro AI ChatbotCase studiesBella SanteSuitorTidio SupportResourcesAI Chatbot BattlesTidio Academy courseHelp DeskDrive customer satisfaction with live chat, ticketing, video calls, and multichannel communication - everything you need for customer service.Learn more about Help DeskFeaturesLive ChatTicketingMultichannelResourcesHelp Desk ChecklistBest PracticesFlowsBoost your lead gen and sales funnels with Flows - no-code automation paths that trigger at crucial moments in the customer journey.Learn more about FlowsPlaybooksReplicate In-store Shopping OnlineWin Leads and Sales with Automation & AIEcommerce hubFlows ROI CalculatorSales Tactics for Ecommerce GrowthAnalyticsKeep track of the data that matters to your business. Monitor the performance of your team, Lyro AI Chatbot, and Flows.Learn more about AnalyticsPlatformsShopifyWordPressSee all integrationsChannelsWhatsappInstagramMessengerSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesPricingEcommerceResourcesCustomer StoriesLearnCompareHelp CenterBlogSee all ResourcesCustomer StoriesNewest case studyeye-oo Boosts Revenue by €177K+ After Installing TidioDiscover how this Shopify store used Tidio to offer better service, recover carts, and boost sales.Customer StoriesADT Security Service Improves CSAT by 30% Using TidioBella Santé Adds $66K+ to Revenue with Lyro AI ChatbotEndeksa’s Lead Generation Grows by 138% with Tidio FlowsSee allLearnTidio AcademyTidio AcademyPropel your customer service to the next level with Tidio’s free courses.PlaybooksReplicate In-store Shopping OnlineHow to Leverage AI in Customer ServiceWin Leads and Sales with Automation & AISee all PlaybooksGuidesSales Tactics for Ecommerce GrowthThe Successful Help Desk ChecklistResourcesPodcastsFlows ROI CalculatorSee all ResourcesCompareCompare TidioTidio vs GorgiasTidio vs IntercomTidio vs LiveChatTidio vs ZendeskAI ShowdownLyro vs ZowieLyro vs AdaLearn more about Lyro AI ChatbotOther comparisonsAI Customer Support: 10 Best SolutionsBest WordPress Chat PluginsTop 10 Shared Inbox ToolsTop 8 Squarespace Chat PluginsHelp CenterGo to Help CenterSetupInstall TidioGet startedWidget customizationManage Your ProjectUsing TidioLyro AI ChatbotFlowsHelp DeskTidio FeaturesOther ResourcesIntegrationsBilling & SubscriptionMobile & Desktop AppsNotificationsBlogGo to Tidio BlogChatbotsBest AI ChatbotsWordPress Chatbot PluginsShopify Chatbot AppsWooCommerce Chatbot PluginsHow to Create a ChatbotLive ChatFree Live Chat Software for WebsitesShopify Live Chat AppsSquarespace Chat PluginsLive Chat for Sales TeamsHow to Add Live Chat to a WebsiteTools for BusinessChatbots for EcommerceLive Chat for EcommerceChatbots for Sales and MarketingChatbots for Real EstateLive Chat for Customer ServiceNewest case studyeye-oo Boosts Revenue by €177K+ After Installing TidioDiscover how this Shopify store used Tidio to offer better service, recover carts, and boost sales.Customer StoriesSee allADT Security Service Improves CSAT by 30% Using TidioBella Santé Adds $66K+ to Revenue with Lyro AI ChatbotEndeksa’s Lead Generation Grows by 138% with Tidio FlowsTidio AcademyTidio AcademyPropel your customer service to the next level with Tidio’s free courses.PlaybooksReplicate In-store Shopping OnlineHow to Leverage AI in Customer ServiceWin Leads and Sales with Automation & AISee all PlaybooksGuidesSales Tactics for Ecommerce GrowthThe Successful Help Desk ChecklistResourcesPodcastsFlows ROI CalculatorSee all ResourcesCompare TidioTidio vs GorgiasTidio vs IntercomTidio vs LiveChatTidio vs ZendeskAI ShowdownLyro vs ZowieLyro vs AdaLearn more about Lyro AI ChatbotOther comparisonsAI Customer Support: 10 Best SolutionsBest WordPress Chat PluginsTop 10 Shared Inbox ToolsTop 8 Squarespace Chat PluginsHelp CenterHit the ground running - Master Tidio quickly with our extensive resource library. Learn about features, customize your experience, and find out how to set up integrations and use our apps.Go to Help CenterSetupInstall TidioGet startedWidget customizationManage Your ProjectUsing TidioLyro AI ChatbotFlowsHelp DeskTidio FeaturesOther ResourcesIntegrationsBilling & SubscriptionMobile & Desktop AppsNotificationsTidio BlogKeep up with emerging trends in customer service and learn from top industry experts. Master Tidio with in-depth guides and uncover real-world success stories in our case studies. Discover the blueprint for exceptional customer experiences and unlock new pathways for business success.Go to Tidio BlogChatbotsBest AI ChatbotsWordPress Chatbot PluginsShopify Chatbot AppsWooCommerce Chatbot PluginsHow to Create a ChatbotLive ChatFree Live Chat Software for WebsitesShopify Live Chat AppsSquarespace Chat PluginsLive Chat for Sales TeamsHow to Add Live Chat to a WebsiteTools for BusinessChatbots for EcommerceLive Chat for EcommerceChatbots for Sales and MarketingChatbots for Real EstateLive Chat for Customer ServicePartnersLet's TalkPartner ProgramsFind a trusted agencyPartner portalContactSee Tidio in actionContact salesGet started freeTidio>Blog>Case StudiesGecko Hospitality Reaches 90% Customer Service Automationby Beata Stefanowicz·Updated Jul 18, 2024See how we can help your businessGet started for freeGet a demo\n\n\n\n\nIn the ever-expanding technological world we live in, a recruitment facilitation company, Gecko Hospitality realized that they needed to stay on the cutting edge of new developments. That’s why, the owners decided to automate the workflows and processes related to sending CVs and answering visitors’ questions in real time. \n\n\n\n\n\n    Not every candidate wants to fill out a lengthy form or application for the possibility of a call back. We needed a quick and efficient way to get the information of these candidates into the hands of our recruiters.\n    \n        \n        \n          \n              Max Sealey              Support Services Manager at Gecko Hospitality           \n    \n    \n    \n\n\n\nThanks to the ease of using the chatbot, the business gains a large number of new resumes every day that it would not have gathered previously. On top of that, the company improved the efficiency of generating leads and getting potential clients.\n\n\n\nConnecting hospitality professionals and changing lives, one career at a time\n\n\n\n\n\n\n\nInformation about the company\n\n\n\n\nIndustry: hospitality\n\n\n\nStarted year: 2000 \n\n\n\nSize: offices in over 50 US states and Canadian provinces\n\n\n\nCountry of origin/headquarters: United States\n\n\n\nTidio products/tactics used: Lyro and chat flows\n\n\n\n\nRobert Krzak started Gecko Hospitality in 2000 because he recognized that there was a more effective way to link quality candidates with the businesses that require their skills. With recruiters who have worked in the hospitality industry and understand what it takes to succeed, the company’s CPC-certified team uses a rigorous interview process to connect professionals to the right employees.\n\n\n\nThe business consistently goes above and beyond to understand your business, your culture, and the individuals who drive your success. That’s because identifying the perfect candidate for each company is the top priority of Gecko Hospitality.\n\n\n\nMoreover, the company was named in the Forbes 2024 List Of America’s Best Executive Recruiting Firms.\n\n\n\nThe challenges Gecko Hospitality faced\n\n\n\nThe company wanted to collect candidates’ and clients’ information around the clock to not miss any opportunities. This proved difficult as it would require employees to be available round the clock allowing the brand to cater to the schedule of the professionals and client companies. \n\n\n\nThe solution to this problem? \n\n\n\nChatbot automations provided by Tidio.\n\n\n\nSo, let’s discover, in more detail, how Tidio helped Gecko Hospitality automate workflows.\n\n\n\nSaving time\n\n\n\nAfter implementing Tidio, Gecko Hospitality enabled people to easily submit resumes. And within as little as 90 seconds, those applications would be in the inbox of the right recruiter anywhere across the globe.\n\n\n\n\n\n\n\nThe same goes to the clients. Recruiters looking for employees can submit their information to the corporate office that assesses their company needs. Then, Gecko’s team gets in touch with the recruiter to fulfill their hiring requirements.\n\n\n\nAutomating segmentation processes\n\n\n\nUsing chat flows, the company was able to create a sorting system for incoming resumes. This system included two simple questions that allowed the flow to determine the best-suited recruiter for the potential candidates. \n\n\n\nThanks to implementing this process, Gecko hospitality was able to eliminate the need for a human to review every resume manually. This helped the brand to decrease the response time drastically and provide support to commonly asked questions 24/7 with the use of a conversational AI, Lyro.\n\n\n\nOn top of that, the conversational AI has become an instrumental part of the company’s customer service, providing information about the brand, where to send resumes, and how to use the job board.\n\n\n\n\n\n    At present, about 90% of conversations are handled by Lyro, and in the vast majority of cases the responses have been perfect. These responses are audited daily to ensure that the correct responses and information is given. My biggest fear of AI hallucination seems to have been unfounded, as even intentionally attempting to get Lyro to provide false information has been unsuccessful.\n    \n        \n        \n          \n              Max Sealey              Support Services Manager at Gecko Hospitality           \n    \n    \n    \n\n\n\n\n\n\n\nCollecting leads\n\n\n\nAfter a mere six months of using Tidio’s software, Gecko Hospitality gained over 257 prospects from chatbots alone. This is thanks to the lead generation chat flow set up on the website that asks for the visitor’s information. \n\n\n\n\n\n\n\nOnce the chat collects the data, the company’s representatives can contact the person for further assessments. This ensures that the business matches the candidate to the right recruiter.\n\n\n\nSupport all the way through\n\n\n\nTidio’s customer success representatives have been of great help with setting up the system. They answered any and all questions about the workings of Tidio and assisted in implementing the required features as well as integrations that save Gecko Hospitality great amounts of time.\n\n\n\n\n\n    Our Customer Success Manager has been instrumental in getting this project off the ground and into the state it is in now.\n    \n        \n        \n          \n              Max Sealey              Support Services Manager at Gecko Hospitality           \n    \n    \n    \n\n\n\nWith the help of the right customer experience platform you can also boost your customer service and generate more leads. Are you ready to try it out?\n\n\n\n\n    \n        \n            Start using chat flows to boost your customer service\n        \n\n        \n            \n                    Get started for free            \n\n                            \n                        Get a demo                \n                    \n                \n                Learn more about chat flows        \n            \n\nShare this article:Beata StefanowiczContent Writer at Tidio with a love for the written word. She scouts around for digital trends and ways to help small and medium businesses grow.Follow me onSimilar articleseye-oo Boosts Revenue by €177K After Installing TidioCase StudiesBella Santé Earns $66K in Sales After Switching to LyroCase StudiesWulff Beltton Hits 4.5/5 Client Rating After Switching to TidioCase StudiesNever Leave Your Customer Without an AnswerTry Tidio for freeTidio>Case Studies>Gecko Hospitality Reaches 90% Customer Service AutomationTidioAbout usContactPartner ProgramsJobs – We're hiring!SecurityStatus PageProductPricingLyro AI ChatbotLive ChatFlowsHelp DeskTidio+All featuresProduct UpdatesIntegrationsShopifyWordPressAll platformsMessengerInstagramWhatsAppAll appsResourcesAll ResourcesBlogCase StudiesHelp CenterTidio vs. GorgiasTidio vs. IntercomTidio vs. LiveChatTidio vs. ZendeskHelp CenterInstallationGet StartedIntegrationsFlows setupDevelopers★★★★★★★★★★4.7 on Shopify4.7 on G24.8 on CapterraJoin 300k+ businesses that use TidioImprove your business with sales, support, and customer service automationGet started freeAvailable on:BrowserAndroidiOSWindowsMacCHATBOTBest AI ChatbotsHow to Create a ChatbotBest Chatbot AppsBest Chatbot BuildersBest AI Chatbot PlatformsLIVE CHATFree Live Chat SoftwareHow to Add Live Chat to a WebsiteEcommerce Live ChatBest Live Chat SoftwareLive Chat for SalesCUSTOMER SERVICEBest Help Desk SoftwareChat Widgets for WebsitesLive Chat for Customer ServiceWordPress Chatbot PluginsCustomer Service ChatbotsSALESEcommerce Chatbots Real Estate ChatbotsSales ChatbotsChatbots for BusinessBest Real Life ChatbotsPLATFORMSShopify Live Chat AppsShopify Chatbot AppsWordPress Chat PluginsSquarespace Chat PluginsMagento Live Chat ExtensionsCHANNELSInstagram ChatbotsFacebook Messenger ChatbotWhatsApp ChatbotInstagram Bots for ReactionsWhatsApp AutomationsTidio 2024. All rights reserved.Privacy PolicyTerms and ConditionsDo not sell and share my datasupport@tidio.net"
}