{
  "url": "https://www.tidio.com/pricing/customer-service/#all-features",
  "data": "<iframe src=\"https://www.googletagmanager.com/ns.html?id=GTM-TFKGCT9\" height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe>Meet Lyro AI Chatbot - Solve up to 70% of customer problems with AILog inProductLyro AI ChatbotHelp Desk & Live ChatFlowsIntegrationsSee all Tidio featuresLyro AI ChatbotLearn more about Lyro AI ChatbotCase studiesBella SanteSuitorTidio SupportResourcesAI Chatbot BattlesTidio Academy courseHelp Desk & Live ChatLearn more about Help DeskFeaturesLive ChatTicketingMultichannelResourcesHelp Desk ChecklistBest PracticesFlowsLearn more about FlowsPlaybooksReplicate In-store Shopping OnlineWin Leads and Sales with Automation & AIEcommerce hubFlows ROI CalculatorSales Tactics for Ecommerce GrowthIntegrationsLearn more about AnalyticsPlatformsShopifyWordPressSee all integrationsChannelsWhatsappInstagramMessengerWatch DemoContact SalesLyro AI ChatbotWin up to 70% of your team’s time back. Automatically answer common questions and perform recurring tasks with AI.Learn more about Lyro AI ChatbotCase studiesBella SanteSuitorTidio SupportResourcesAI Chatbot BattlesTidio Academy courseHelp DeskDrive customer satisfaction with live chat, ticketing, video calls, and multichannel communication - everything you need for customer service.Learn more about Help DeskFeaturesLive ChatTicketingMultichannelResourcesHelp Desk ChecklistBest PracticesFlowsBoost your lead gen and sales funnels with Flows - no-code automation paths that trigger at crucial moments in the customer journey.Learn more about FlowsPlaybooksReplicate In-store Shopping OnlineWin Leads and Sales with Automation & AIEcommerce hubFlows ROI CalculatorSales Tactics for Ecommerce GrowthAnalyticsKeep track of the data that matters to your business. Monitor the performance of your team, Lyro AI Chatbot, and Flows.Learn more about AnalyticsPlatformsShopifyWordPressSee all integrationsChannelsWhatsappInstagramMessengerSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesPricingEcommerceResourcesCustomer StoriesLearnCompareHelp CenterBlogSee all ResourcesCustomer StoriesNewest case studyeye-oo Boosts Revenue by €177K+ After Installing TidioDiscover how this Shopify store used Tidio to offer better service, recover carts, and boost sales.Customer StoriesADT Security Service Improves CSAT by 30% Using TidioBella Santé Adds $66K+ to Revenue with Lyro AI ChatbotEndeksa’s Lead Generation Grows by 138% with Tidio FlowsSee allLearnTidio AcademyTidio AcademyPropel your customer service to the next level with Tidio’s free courses.PlaybooksReplicate In-store Shopping OnlineHow to Leverage AI in Customer ServiceWin Leads and Sales with Automation & AISee all PlaybooksGuidesSales Tactics for Ecommerce GrowthThe Successful Help Desk ChecklistResourcesPodcastsFlows ROI CalculatorSee all ResourcesCompareCompare TidioTidio vs GorgiasTidio vs IntercomTidio vs LiveChatTidio vs ZendeskAI ShowdownLyro vs ZowieLyro vs AdaLearn more about Lyro AI ChatbotOther comparisonsAI Customer Support: 10 Best SolutionsBest WordPress Chat PluginsTop 10 Shared Inbox ToolsTop 8 Squarespace Chat PluginsHelp CenterGo to Help CenterSetupInstall TidioGet startedWidget customizationManage Your ProjectUsing TidioLyro AI ChatbotFlowsHelp DeskTidio FeaturesOther ResourcesIntegrationsBilling & SubscriptionMobile & Desktop AppsNotificationsBlogGo to Tidio BlogChatbotsBest AI ChatbotsWordPress Chatbot PluginsShopify Chatbot AppsWooCommerce Chatbot PluginsHow to Create a ChatbotLive ChatFree Live Chat Software for WebsitesShopify Live Chat AppsSquarespace Chat PluginsLive Chat for Sales TeamsHow to Add Live Chat to a WebsiteTools for BusinessChatbots for EcommerceLive Chat for EcommerceChatbots for Sales and MarketingChatbots for Real EstateLive Chat for Customer ServiceNewest case studyeye-oo Boosts Revenue by €177K+ After Installing TidioDiscover how this Shopify store used Tidio to offer better service, recover carts, and boost sales.Customer StoriesSee allADT Security Service Improves CSAT by 30% Using TidioBella Santé Adds $66K+ to Revenue with Lyro AI ChatbotEndeksa’s Lead Generation Grows by 138% with Tidio FlowsTidio AcademyTidio AcademyPropel your customer service to the next level with Tidio’s free courses.PlaybooksReplicate In-store Shopping OnlineHow to Leverage AI in Customer ServiceWin Leads and Sales with Automation & AISee all PlaybooksGuidesSales Tactics for Ecommerce GrowthThe Successful Help Desk ChecklistResourcesPodcastsFlows ROI CalculatorSee all ResourcesCompare TidioTidio vs GorgiasTidio vs IntercomTidio vs LiveChatTidio vs ZendeskAI ShowdownLyro vs ZowieLyro vs AdaLearn more about Lyro AI ChatbotOther comparisonsAI Customer Support: 10 Best SolutionsBest WordPress Chat PluginsTop 10 Shared Inbox ToolsTop 8 Squarespace Chat PluginsHelp CenterHit the ground running - Master Tidio quickly with our extensive resource library. Learn about features, customize your experience, and find out how to set up integrations and use our apps.Go to Help CenterSetupInstall TidioGet startedWidget customizationManage Your ProjectUsing TidioLyro AI ChatbotFlowsHelp DeskTidio FeaturesOther ResourcesIntegrationsBilling & SubscriptionMobile & Desktop AppsNotificationsTidio BlogKeep up with emerging trends in customer service and learn from top industry experts. Master Tidio with in-depth guides and uncover real-world success stories in our case studies. Discover the blueprint for exceptional customer experiences and unlock new pathways for business success.Go to Tidio BlogChatbotsBest AI ChatbotsWordPress Chatbot PluginsShopify Chatbot AppsWooCommerce Chatbot PluginsHow to Create a ChatbotLive ChatFree Live Chat Software for WebsitesShopify Live Chat AppsSquarespace Chat PluginsLive Chat for Sales TeamsHow to Add Live Chat to a WebsiteTools for BusinessChatbots for EcommerceLive Chat for EcommerceChatbots for Sales and MarketingChatbots for Real EstateLive Chat for Customer ServicePartnersLet's TalkPartner ProgramsFind a trusted agencyPartner portalContactSee Tidio in actionContact salesGet startedContact salesReach your customers\nnow, pick a plan laterStart with a 7-day trial to test all Tidio features for free. Choose one or more plans to create your custom solution at the end of the trial. Free-forever plans available.Customer ServiceIncrease customer satisfaction with dedicated live chat & helpdesk toolsLyro AI ChatbotSolve up to 70% of customer problems with Lyro - the AI chatbotFlowsAchieve your goals faster with sales and customer service automationCustomer ServiceIncrease customer satisfaction with dedicated live chat & helpdesk toolsLyro AI ChatbotSolve up to 70% of customer problems with Lyro - the AI chatbotFlowsAchieve your goals faster with sales and customer service automationMonthly2 months freeAnnuallyFreeFor new businesses seeking to start offering great customer service. Free forever. No credit card required. 0USD/month50 Handled Conversations50 Handled ConversationsGet started This plan includes:Live chatTicketingSocial media integrationsSee all featuresStarterIdeal for small businesses focused on enhancing customer satisfaction via live chat support. 29USD/month100 Handled Conversations100 Handled ConversationsGet started7-day free trialEverything in Free, plus:Basic analyticsLive visitors listOperating hoursLive chat supportSee all featuresMOST POPULARGrowthIdeal for teams of all sizes prioritizing customer service as their competitive advantage. 59USD/month0-250 Handled Conversations0-250 Handled Conversations251-400 Handled Conversations401-600 Handled Conversations601-800 Handled Conversations801-1000 Handled Conversations1001-1500 Handled Conversations1501-2000 Handled ConversationsGet started7-day free trialEverything in Starter, plus:Up to 2000 Handled ConversationsAdvanced analyticsTidio power featuresNo Tidio branding (add-on)PermissionsSee all featuresTidio+For businesses requiring better limits, additional integrations, advanced features, and premium support.Starts at749USD/monthContact sales Everything in Growth, plus:Custom brandingMultisiteDepartmentsMultilanguageOpen APISee all featuresSolution for established businessesEnterpriseFor businesses requiring unlimited products, additional integrations, advanced features, and premium support.Unlimited quotaAnalysis & MonitoringSuper admin roleLyro as managed serviceSee all features2999USD/mo.Contact salesCompare plans and featuresEnjoy free lite customer success onboarding with all subscriptions above $250 monthlyFree0 USD/mo.Get started Starter29 USD/mo.Get started7-day free trialMOST POPULARGrowthStarts at 59 USD/mo.Get started7-day free trialTidio+Starts at 749 USD/mo.Contact sales Enterprise2999 USD/mo.Contact sales Compare plansHandled Conversations50100250 - 2000CustomUnlimitedSeatsUnlimitedUnlimitedUnlimitedUnlimitedUnlimitedLive chat & TicketingLive chatTicketingEmail management systemLive video callsIntegrationsMessenger integrationInstagram integrationWhatsApp integrationEmail integrationApp integrationsAppsMobile appDesktop appCustomizationBasic widget customizationCustom sending domainCustom email signatureNo Tidio brandingAdd-onCustom brandingAnalyticsBasic analyticsAdvanced analyticsFeaturesTidio AI reply assistantLive visitors listOperating hoursLive typingViewed pages historyVisitors infoVisitor notesAutomatic responseAutomatic chat assignmentAutomated satisfaction surveyAutomated conversation solvingCanned responsesPermissionsNative Shopify actionsMultisiteMultilanguageDepartmentsOpen APIServicesSupport over emailCustomer Success onboardingLite onboarding for $250+ subscriptionsOngoing Customer Success supportOngoing Customer Success supportSupport over live chatFlows building and strategy assistanceDedicated Success ManagerTraining sessionsAccount reviews     Frequently Asked QuestionsWhat is a Conversation?Conversation is any live chat, ticket, email or social media channel conversation. A visitor, operator or an automated flow may initiate a conversation.\n \nRemember that not all conversations are counted as “Handled conversations”What is a “Handled conversation”?\"Handled Conversation\" refers to any live chat, ticket, email or social media channel conversation that includes a message from a human agent (you). Unanswered messages initiated by visitors/customers are not counted, ensuring you're billed only for relevant interactions.\n \nResponses from Flows and Lyro AI Chatbot are not counted as ‘agent replies’.Will I pay for unwanted conversations?No. A conversation is only billed as a Handled Conversation once you reply using Tidio or proactively initiate a conversation with your visitor. If you don’t respond to a customer conversation – if it’s spam or simply a message that doesn’t require a reply – the conversation won’t count toward your monthly limit.Will I pay for multiple messages within one conversation?A conversation that receives a response by a human agent or is initiated by a human agent will only be counted as one Handled Conversation regardless of how many messages are sent or received on the thread.How does the free trial work?During the free 7-day trial, you can test all Tidio features and plans and see how to improve customer service and accelerate sales. You don’t need to provide us with your credit card information to access the free trial.\n \nAt the end of the trial, your account will automatically be downgraded to the Free plan unless you upgrade your subscription to a paid option.\n \nIt means that you can use the full feature set of any Customer Service, Lyro AI Chatbot, Flows or Email Marketing plan within your first 7 days with Tidio.Can I change my subscription anytime I want?Yes, you can. You can downgrade or upgrade your subscription at any time.\n \nPlease note that any subscription changes will come into effect at the start of your next billing cycle meaning that you will keep your premium features until the end of the existing cycle.Can I subscribe to more than one product?Absolutely. Our products are designed to complement each other, so you can mix and match to create a solution tailored to your business needs.\n \nFor example, you can combine a Customer Service plan with the Flows and Lyro AI Chatbot plans to create an AI customer service suite that solves most customer problems without human intervention, freeing your live support agents to handle complicated requests.\n \nYou can subscribe to a single paid plan and use the free features of other plans at the same time. For example, you can subscribe to the Growth Customer Service plan and use the free plan versions of Lyro AI Chatbot and Flows.\n \nYou can also subscribe to the free versions of all our plans. Alternatively, you can also bundle multiple paid plans for more features and better limits.Can I use Flows and/or Lyro AI Chatbot with a Customer Service plan and create a bundle?Absolutely. After subscribing to one of our products you can still use free features and quotas from the free plan for all other products.\n \nWith a Flows plan, you can add our pre-defined Flows templates to your website or manually create automated workflow scenarios with our drag-and-drop automation builder.\n \nThe Lyro AI Chatbot plan enables you to handle up to 300 conversations per month with AI. However, you can let Lyro handle as many conversations as you want with Tidio+.Can I add Tidio live chat to more than one website/store?Yes, you can add Tidio to multiple sites and/or stores.\n \nPlease note, however, that the live chat widget will share all the appearance and behavior settings across all your websites/stores. This means it will have the same color scheme, it will go online/offline according to the same DND hours, it will display the same offline messages, etc. If you want to have a different behavior for every website, talk to us.Can I send live chat messages?Yes. The Customer Service plans enable you to proactively engage your website visitors through the live chat widget.How does the ticketing system work?Tidio’s AI-powered ticketing system enables you to transform incoming support emails, live chat conversations, and social media messages into tickets and assign them to available operators.\n \nYou can monitor tickets and add notes or custom tags to follow up on conversations.\n \nTidio automatically analyzes your conversations and organizes them based on customer intent so your support team can easily spot and prioritize important requests.How many support agents can I add to my Tidio project?You can add up to 10 agents on self-serve plans and custom numbers on the Tidio+ package.Offer great customer service with TidioStart with a 7-day trial to test all Tidio features for free or contact sales to see Tidio in action.Get started freeNo credit card requiredContact salesTidio>Pricing>Pricing – Customer ServiceTidioAbout usContactPartner ProgramsJobs – We're hiring!SecurityStatus PageProductPricingLyro AI ChatbotLive ChatFlowsHelp DeskTidio+All featuresProduct UpdatesIntegrationsShopifyWordPressAll platformsMessengerInstagramWhatsAppAll appsResourcesAll ResourcesBlogCase StudiesHelp CenterTidio vs. GorgiasTidio vs. IntercomTidio vs. LiveChatTidio vs. ZendeskHelp CenterInstallationGet StartedIntegrationsFlows setupDevelopersContact salesPricing★★★★★★★★★★4.7 on Shopify4.7 on G24.8 on CapterraJoin 300k+ businesses that use TidioImprove your business with sales, support, and customer service automationGet started freeAvailable on:BrowserAndroidiOSWindowsMacCHATBOTBest AI ChatbotsHow to Create a ChatbotBest Chatbot AppsBest Chatbot BuildersBest AI Chatbot PlatformsLIVE CHATFree Live Chat SoftwareHow to Add Live Chat to a WebsiteEcommerce Live ChatBest Live Chat SoftwareLive Chat for SalesCUSTOMER SERVICEBest Help Desk SoftwareChat Widgets for WebsitesLive Chat for Customer ServiceWordPress Chatbot PluginsCustomer Service ChatbotsSALESEcommerce Chatbots Real Estate ChatbotsSales ChatbotsChatbots for BusinessBest Real Life ChatbotsPLATFORMSShopify Live Chat AppsShopify Chatbot AppsWordPress Chat PluginsSquarespace Chat PluginsMagento Live Chat ExtensionsCHANNELSInstagram ChatbotsFacebook Messenger ChatbotWhatsApp ChatbotInstagram Bots for ReactionsWhatsApp AutomationsTidio 2024. All rights reserved.ENPrivacy PolicyTerms and ConditionsDo not sell and share my datasupport@tidio.net"
}