{
  "url": "https://www.tidio.com/blog/eye-oo-case-study/",
  "data": "<iframe src=\"https://www.googletagmanager.com/ns.html?id=GTM-TFKGCT9\" height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe>Meet Lyro AI Chatbot - Solve up to 70% of customer problems with AILog inProductLyro AI ChatbotHelp Desk & Live ChatFlowsIntegrationsSee all Tidio featuresLyro AI ChatbotLearn more about Lyro AI ChatbotCase studiesBella SanteSuitorTidio SupportResourcesAI Chatbot BattlesTidio Academy courseHelp Desk & Live ChatLearn more about Help DeskFeaturesLive ChatTicketingMultichannelResourcesHelp Desk ChecklistBest PracticesFlowsLearn more about FlowsPlaybooksReplicate In-store Shopping OnlineWin Leads and Sales with Automation & AIEcommerce hubFlows ROI CalculatorSales Tactics for Ecommerce GrowthIntegrationsLearn more about AnalyticsPlatformsShopifyWordPressSee all integrationsChannelsWhatsappInstagramMessengerWatch DemoContact SalesLyro AI ChatbotWin up to 70% of your team’s time back. Automatically answer common questions and perform recurring tasks with AI.Learn more about Lyro AI ChatbotCase studiesBella SanteSuitorTidio SupportResourcesAI Chatbot BattlesTidio Academy courseHelp DeskDrive customer satisfaction with live chat, ticketing, video calls, and multichannel communication - everything you need for customer service.Learn more about Help DeskFeaturesLive ChatTicketingMultichannelResourcesHelp Desk ChecklistBest PracticesFlowsBoost your lead gen and sales funnels with Flows - no-code automation paths that trigger at crucial moments in the customer journey.Learn more about FlowsPlaybooksReplicate In-store Shopping OnlineWin Leads and Sales with Automation & AIEcommerce hubFlows ROI CalculatorSales Tactics for Ecommerce GrowthAnalyticsKeep track of the data that matters to your business. Monitor the performance of your team, Lyro AI Chatbot, and Flows.Learn more about AnalyticsPlatformsShopifyWordPressSee all integrationsChannelsWhatsappInstagramMessengerSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesSee customer storyTidio+ Premium PlanGrow faster with done-for-you automation, tailored optimization strategies, and custom limits.Watch DemoContact SalesPricingEcommerceResourcesCustomer StoriesLearnCompareHelp CenterBlogSee all ResourcesCustomer StoriesNewest case studyeye-oo Boosts Revenue by €177K+ After Installing TidioDiscover how this Shopify store used Tidio to offer better service, recover carts, and boost sales.Customer StoriesADT Security Service Improves CSAT by 30% Using TidioBella Santé Adds $66K+ to Revenue with Lyro AI ChatbotEndeksa’s Lead Generation Grows by 138% with Tidio FlowsSee allLearnTidio AcademyTidio AcademyPropel your customer service to the next level with Tidio’s free courses.PlaybooksReplicate In-store Shopping OnlineHow to Leverage AI in Customer ServiceWin Leads and Sales with Automation & AISee all PlaybooksGuidesSales Tactics for Ecommerce GrowthThe Successful Help Desk ChecklistResourcesPodcastsFlows ROI CalculatorSee all ResourcesCompareCompare TidioTidio vs GorgiasTidio vs IntercomTidio vs LiveChatTidio vs ZendeskAI ShowdownLyro vs ZowieLyro vs AdaLearn more about Lyro AI ChatbotOther comparisonsAI Customer Support: 10 Best SolutionsBest WordPress Chat PluginsTop 10 Shared Inbox ToolsTop 8 Squarespace Chat PluginsHelp CenterGo to Help CenterSetupInstall TidioGet startedWidget customizationManage Your ProjectUsing TidioLyro AI ChatbotFlowsHelp DeskTidio FeaturesOther ResourcesIntegrationsBilling & SubscriptionMobile & Desktop AppsNotificationsBlogGo to Tidio BlogChatbotsBest AI ChatbotsWordPress Chatbot PluginsShopify Chatbot AppsWooCommerce Chatbot PluginsHow to Create a ChatbotLive ChatFree Live Chat Software for WebsitesShopify Live Chat AppsSquarespace Chat PluginsLive Chat for Sales TeamsHow to Add Live Chat to a WebsiteTools for BusinessChatbots for EcommerceLive Chat for EcommerceChatbots for Sales and MarketingChatbots for Real EstateLive Chat for Customer ServiceNewest case studyeye-oo Boosts Revenue by €177K+ After Installing TidioDiscover how this Shopify store used Tidio to offer better service, recover carts, and boost sales.Customer StoriesSee allADT Security Service Improves CSAT by 30% Using TidioBella Santé Adds $66K+ to Revenue with Lyro AI ChatbotEndeksa’s Lead Generation Grows by 138% with Tidio FlowsTidio AcademyTidio AcademyPropel your customer service to the next level with Tidio’s free courses.PlaybooksReplicate In-store Shopping OnlineHow to Leverage AI in Customer ServiceWin Leads and Sales with Automation & AISee all PlaybooksGuidesSales Tactics for Ecommerce GrowthThe Successful Help Desk ChecklistResourcesPodcastsFlows ROI CalculatorSee all ResourcesCompare TidioTidio vs GorgiasTidio vs IntercomTidio vs LiveChatTidio vs ZendeskAI ShowdownLyro vs ZowieLyro vs AdaLearn more about Lyro AI ChatbotOther comparisonsAI Customer Support: 10 Best SolutionsBest WordPress Chat PluginsTop 10 Shared Inbox ToolsTop 8 Squarespace Chat PluginsHelp CenterHit the ground running - Master Tidio quickly with our extensive resource library. Learn about features, customize your experience, and find out how to set up integrations and use our apps.Go to Help CenterSetupInstall TidioGet startedWidget customizationManage Your ProjectUsing TidioLyro AI ChatbotFlowsHelp DeskTidio FeaturesOther ResourcesIntegrationsBilling & SubscriptionMobile & Desktop AppsNotificationsTidio BlogKeep up with emerging trends in customer service and learn from top industry experts. Master Tidio with in-depth guides and uncover real-world success stories in our case studies. Discover the blueprint for exceptional customer experiences and unlock new pathways for business success.Go to Tidio BlogChatbotsBest AI ChatbotsWordPress Chatbot PluginsShopify Chatbot AppsWooCommerce Chatbot PluginsHow to Create a ChatbotLive ChatFree Live Chat Software for WebsitesShopify Live Chat AppsSquarespace Chat PluginsLive Chat for Sales TeamsHow to Add Live Chat to a WebsiteTools for BusinessChatbots for EcommerceLive Chat for EcommerceChatbots for Sales and MarketingChatbots for Real EstateLive Chat for Customer ServicePartnersLet's TalkPartner ProgramsFind a trusted agencyPartner portalContactSee Tidio in actionContact salesGet started freeTidio>Blog>Case Studieseye-oo Boosts Revenue by €177K After Installing Tidioby Beata Stefanowicz·Updated Apr 10, 2024See how can we help your businessGet demoLearn more\n\n\n\n\nCreating a distinct and captivating experience for customers is a top priority for eye-oo. But with growing traffic, it started to become difficult to always be there for the shoppers during their journey. \n\n\n\nThat’s why the business turned to Tidio for help. \n\n\n\nTidio enabled eye-oo to interact with customers in real-time, boost engagement, and make assistance more accessible for buyers. On top of that, eye-oo discovered how to to quantify conversions on autopilot, in a user-friendly manner.\n\n\n\nLet’s find out more about the results this eyewear multi-brand ecommerce business achieved using Tidio.\n\n\n\nShopping inspiration for top brands\n\n\n\n\n\n\n\nInformation about the company:\n\n\n\n\nIndustry: ecommerce\n\n\n\nStarted year: 2020\n\n\n\nCountry of origin: Italy\n\n\n\nTidio products used: live chat, chat flows, and analytics\n\n\n\n\neye-oo is a multi-brand platform that offers the latest models from sought-after fashion brands, as well as unique eyewear from upcoming designers. \n\n\n\nEveryone is sure to find their perfect pair of glasses on this website, including anything from bestsellers like Ray-ban and Oakley, through the latest designs from Balenciaga, Gucci, and Saint Laurent, all the way to handcrafted, limited edition pieces from Jacques Marie Mage.\n\n\n\nThis ecommerce business pays high attention to ensuring quality craftsmanship, due care, and accuracy in all processes from purchasing to dispatching of products. The brand also offers assistance from qualified professionals in the shopping process to help customers with their eyewear purchases.\n\n\n\nThe challenges eye-oo faced\n\n\n\nThe company was using Shopify’s native inbox to chat with customers back in 2020 when it started operating. However, this solution proved to be lacking in terms of aesthetics and user experience when eye-oo received a significant increase in traffic. \n\n\n\nAnd because trust is a big concern when selling designer eyewear online, the business needed to be able to assist shoppers immediately so as not to lose potential clients.\n\n\n\nIn addition to that, eye-oo found that the best way to change a prospective customer to a loyal one was by creating a unique and personal eyewear experience. \n\n\n\n\n\n    We wanted to find a tool that allowed us to curate our customer’s journey by customizing and implementing automations that could respond to shoppers’ questions promptly, guide them through the purchasing process, and ultimately boost sales without losing our personal touch.\n    \n        \n        \n          \n              Evelin Lopez              Marketing Manager at eye-oo            \n    \n    \n    \n\n\n\nThe solution to this problem? \n\n\n\nA complete customer experience solution provided by Tidio.\n\n\n\n\n\n    Our main goals were to increase sales, collect leads, and build trust by reducing the number of missed conversations.\n    \n        \n        \n          \n              Evelin Lopez              Marketing Manager at eye-oo            \n    \n    \n    \n\n\n\nSo, let’s discover in more detail how Tidio helped eye-oo boost sales and improve customer relations.\n\n\n\nIncrease in sales\n\n\n\nBefore using Tidio, eye-oo didn’t have access to any abandoned cart recovery automations which caused them to lose sales. But once the business implemented Tidio and started using shopping cart recovery tools, eye-oo saw a 25% increase in sales and a fivefold boost in conversions.\n\n\n\n\n\n    Since changing to Tidio and implementing the cart abandonment chatbot, we were able to increase the number of conversions. From the 537 conversations the bot managed, it assisted in 1.6k EUR total sales in 2023 alone.\n    \n        \n        \n          \n              Evelin Lopez              Marketing Manager at eye-oo            \n    \n    \n    \n\n\n\nThe business measures these results by utilizing key metrics, including revenue, conversion rate, average coupon used, and sales cycle length.\n\n\n\nMonitoring these KPIs helps the brand evaluate the effectiveness of the sales efforts, identify areas for optimization, and make data-driven decisions to ensure sustainable business growth.\n\n\n\n\n\n\n\neye-oo achieved €177K revenue growth attributed to Tidio and chat flows. And if the bot is not able to help a customer during the checkout process, it assists the operators by collecting the user’s information. This allows the operators to analyze the customer’s needs based on the collected data and guide the user with a personalized solution.\n\n\n\nDecreased waiting time\n\n\n\nWhile using Shopify chat, the operators were handling all the customer conversations. This means that if they were all busy chatting with shoppers, a new person had to wait around 2-5 minutes for assistance.\n\n\n\nThis waiting time decreased to around 30 seconds after implementing Tidio.\n\n\n\n\n\n\n\nThat’s because the majority of commonly asked questions as well as queries about order updates or returns information are handled by the bots immediately. And the agents are free to focus on higher-impact inquiries and unique situations, such as overcoming a trust barrier or a post-sale delivery issue.\n\n\n\nTidio helped the business preserve crucial sales. The live chat feature helps operators to frequently engage with customers who are in the final stages of the purchasing process and encounter difficulties with checkout or experience issues. The immediate support prevents customers from feeling frustrated and alleviates any anxieties they may have about purchasing on the platform.\n\n\n\n\n\n    By offering prompt and helpful assistance through Tidio's live chat and chat flows features, we have built trust with our customers.\n    \n        \n        \n          \n              Evelin Lopez              Marketing Manager at eye-oo            \n    \n    \n    \n\n\n\nAnd as we know, happy clients are just a small step away from becoming loyal to a brand.\n\n\n\nImproved customer service automation\n\n\n\neye-oo also achieved customer service automation using chat flows from Tidio. The bots take care of the recurring issues and frequently asked questions while the operators handle the more complicated ones.\n\n\n\nAnd chat flows are doing a good job at it. From 2,233 total conversations, they were able to handle 1,825 successfully while acquiring 1,305 leads at the same time.\n\n\n\n\n\n\n\n\n\n    When customers leave a review about their experience with eye-oo, they mention the live chat feature on our website and how they were helped immediately.\n    \n        \n        \n          \n              Evelin Lopez              Marketing Manager at eye-oo            \n    \n    \n    \n\n\n\nOn top of that, the setup of the bots is easy and user-friendly. The company made use of the templates and customized them for specific needs, which proved to be the quickest way to implement the virtual assistants on the website.\n\n\n\nFocus on personalized experiences to earn loyalty\n\n\n\nThrough the live chat feature, the operators can address any concerns or questions customers may have, thereby increasing the likelihood of completing a purchase. \n\n\n\nTidio ensures that operators can engage with customers whenever they have inquiries or need assistance. At the same time, chat flows handle queries during non-business hours, ensuring a cohesive customer journey and round-the-clock availability.\n\n\n\nThe personal interactions visitors have leave them feeling reassured and enhance the overall shopping experience. In the long run, this leads to improved loyalty and increased revenue for the business.\n\n\n\n\n\n    Overall, Tidio exceeded our expectations! We knew that it had a variety of features to choose from, but did not know how powerful and effective they could be. Tidio has helped us with closing sales, building trust, and quantifying the impact of customer service.\n    \n        \n        \n          \n              Evelin Lopez              Marketing Manager at eye-oo            \n    \n    \n    \n\n\n\nWith the right platform, your business can also easily enhance the customer experience and increase revenue as a result. Why not give it a try?\n\n\n\n\n    \n        \n            Start using smart chat flows to boost your revenue\n        \n\n        \n            \n                    Get started for free            \n\n                            \n                        Get a demo                \n                    \n            \n\nShare this article:Beata StefanowiczContent Writer at Tidio with a love for the written word. She scouts around for digital trends and ways to help small and medium businesses grow.Follow me onSimilar articlesBella Santé Earns $66K in Sales After Switching to LyroCase StudiesWulff Beltton Hits 4.5/5 Client Rating After Switching to TidioCase StudiesADT Security Service Boosts Sales By 17% Using TidioCase StudiesNever Leave Your Customer Without an AnswerTry Tidio for freeTidio>Case Studies>eye-oo Boosts Revenue by €177K After Installing TidioTidioAbout usContactPartner ProgramsJobs – We're hiring!SecurityStatus PageProductPricingLyro AI ChatbotLive ChatFlowsHelp DeskTidio+All featuresProduct UpdatesIntegrationsShopifyWordPressAll platformsMessengerInstagramWhatsAppAll appsResourcesAll ResourcesBlogCase StudiesHelp CenterTidio vs. GorgiasTidio vs. IntercomTidio vs. LiveChatTidio vs. ZendeskHelp CenterInstallationGet StartedIntegrationsFlows setupDevelopers★★★★★★★★★★4.7 on Shopify4.7 on G24.8 on CapterraJoin 300k+ businesses that use TidioImprove your business with sales, support, and customer service automationGet started freeAvailable on:BrowserAndroidiOSWindowsMacCHATBOTBest AI ChatbotsHow to Create a ChatbotBest Chatbot AppsBest Chatbot BuildersBest AI Chatbot PlatformsLIVE CHATFree Live Chat SoftwareHow to Add Live Chat to a WebsiteEcommerce Live ChatBest Live Chat SoftwareLive Chat for SalesCUSTOMER SERVICEBest Help Desk SoftwareChat Widgets for WebsitesLive Chat for Customer ServiceWordPress Chatbot PluginsCustomer Service ChatbotsSALESEcommerce Chatbots Real Estate ChatbotsSales ChatbotsChatbots for BusinessBest Real Life ChatbotsPLATFORMSShopify Live Chat AppsShopify Chatbot AppsWordPress Chat PluginsSquarespace Chat PluginsMagento Live Chat ExtensionsCHANNELSInstagram ChatbotsFacebook Messenger ChatbotWhatsApp ChatbotInstagram Bots for ReactionsWhatsApp AutomationsTidio 2024. All rights reserved.Privacy PolicyTerms and ConditionsDo not sell and share my datasupport@tidio.net"
}